{"meta":{"title":"赤色娱乐","subtitle":"belong to our world","description":"belong to our world","author":"xiaoz","url":"https://www.iloveyz.com"},"pages":[{"title":"About","date":"2017-08-15T13:57:05.136Z","updated":"2017-08-15T13:57:05.136Z","comments":true,"path":"about/index.html","permalink":"https://www.iloveyz.com/about/index.html","excerpt":"","text":"作者懒得一B，居然没有更新…"},{"title":"archives","date":"2017-08-08T03:02:43.000Z","updated":"2017-08-08T03:02:43.790Z","comments":true,"path":"archives/index.html","permalink":"https://www.iloveyz.com/archives/index.html","excerpt":"","text":""},{"title":"Categories","date":"2017-08-08T15:16:08.708Z","updated":"2017-08-08T15:15:39.635Z","comments":true,"path":"categories/index.html","permalink":"https://www.iloveyz.com/categories/index.html","excerpt":"","text":""},{"title":"I like it...","date":"2017-11-24T14:12:14.727Z","updated":"2017-11-24T14:12:14.727Z","comments":true,"path":"like/index.html","permalink":"https://www.iloveyz.com/like/index.html","excerpt":"","text":""},{"title":"Project","date":"2017-08-08T08:31:49.189Z","updated":"2017-08-08T06:27:04.936Z","comments":true,"path":"project/index.html","permalink":"https://www.iloveyz.com/project/index.html","excerpt":"","text":""},{"title":"Topics","date":"2018-08-06T14:36:11.342Z","updated":"2018-08-06T14:36:11.342Z","comments":true,"path":"topics/index.html","permalink":"https://www.iloveyz.com/topics/index.html","excerpt":"","text":""},{"title":"Tags","date":"2017-08-08T14:50:21.612Z","updated":"2017-08-08T06:27:04.939Z","comments":true,"path":"tags/index.html","permalink":"https://www.iloveyz.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"番剧爱好者，好像很厉害的样子...","slug":"番剧爱好者，好像很厉害的样子","date":"2019-03-14T16:30:10.000Z","updated":"2019-03-14T16:30:14.297Z","comments":true,"path":"56556/","link":"","permalink":"https://www.iloveyz.com/56556/","excerpt":"好像很久没有更新的样子，不过的确有很久了。距离上次大概有三个多月了，感觉自己萌萌哒又很厉害的样子。","text":"好像很久没有更新的样子，不过的确有很久了。距离上次大概有三个多月了，感觉自己萌萌哒又很厉害的样子。 其实不是不更新，而是懒，主要更新hexo太麻烦之类这样的借口。没有啥想折腾的，只好闲置着啦！~感觉还是折腾更有成就感，而且折腾才是玩儿博客的核心所在？未知…{:doge:}但是回到博客还是莫名的亲切，又是熟悉的赶脚… 以前玩儿博客都是需要花钱购买的，所以劲头很足，毕竟不能浪费，但也最多半年这样。而且绝对不会用到需要续费。所以，像我这种随意更新且热度不够的人还是github以及coding提供的page更适合。 强行转移，回归正题最近一直在看动漫，多数是运动番剧。因为本人是个半宅状态，平时也不喜欢运动，所以就做了一把云运动，- -。不仅跑了步，还打了排球，真是丰富多彩呢。{:可爱:} 跑步番剧 强风吹拂（追番中） 首先，确认过画风是我喜欢的风格，一开始纯粹是太无聊，打发时间的，也是在B站偶尔看到的，看到封面就吸引我了。毕竟是喜欢的风格，所以就进去研究了一下。说实在，故事一开始没有感觉多精彩，而是越往后看越觉得不错。然后就追上了，不是很长的剧集，大概也就20多集的样子。目前还在看，未完结，处于养肥了再看的状态。 故事的大概剧情就是，主角把自己看好的人聚集在一起，然后朝着“箱根驿传”这个目标奔跑的一群人。 排球番剧 排球少年（已完结） 因为看了强风吹拂，热血沸腾，然后就想起了以前看过一开始一点点的排球少年。然后就星夜追剧。剧情很优秀，而且很热血。不亚于强风吹拂。感觉比得上当年的灌篮高手。 在这之后就剧荒了，然后在结束假期上班后，突然想到了一部曾挺火的一部动漫，东京喰种。 较为血腥的番剧 东京喰种（已完结） 不得不说，前两季，特别是第一季都很好看。而且第一季结尾，燃爆。因为当时是晚上看的，顿时困意全无。结果熬夜到凌晨3-4点的样子。 第二季虽然也挺好，但是精彩程度逊色于第一季。第三季开始就走下坡路线了，很多地方都很仓促，不是特别连贯（估计看漫画会好一点）。而且需要吐槽的是，第二季看玩，去看第三季的时候居然给我一种，走错片场的感觉。陌生的人物，陌生的故事。略微有些莫名其妙。 至于第四季，我还未看玩，才看了一半的样子。不知道后面的剧情，所以不过多评价。 总体来说，还算值得一看。毕竟都是我喜欢的画风。看起来挺爽。 以上，就是我最近所做的比较无聊的勉强能拿出来说的事儿。另，网站一直想换个新风格，但没有好的想法，一直搁置。所以，也没啥好说的。 嗯嗯，先这样…让我来静静地等待下次的再次更新…{:捂脸:}","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"动漫","slug":"动漫","permalink":"https://www.iloveyz.com/tags/动漫/"},{"name":"番剧","slug":"番剧","permalink":"https://www.iloveyz.com/tags/番剧/"}]},{"title":"最近不务正业玩了玩单机游戏...","slug":"最近不务正业玩了玩单机游戏","date":"2018-11-27T12:44:29.910Z","updated":"2018-11-27T13:34:02.391Z","comments":true,"path":"2999/","link":"","permalink":"https://www.iloveyz.com/2999/","excerpt":"最近工作繁忙，算是忙里偷闲，去下载了单机游戏玩了玩，好久没娱乐。整天基本除了工作还是工作。毕竟工作使我快乐嘛！~","text":"最近工作繁忙，算是忙里偷闲，去下载了单机游戏玩了玩，好久没娱乐。整天基本除了工作还是工作。毕竟工作使我快乐嘛！~ 其实说起单机，我真的是玩的单机不是特别多，比较喜欢模拟经营和开放式地图的做任务类游戏，像什么我的世界，性福模拟人生，侠盗飞车（GTA）这一类的游戏。 比较喜欢像我的世界那种抖M式的科技类MOD，工业，格雷科技。工业算不上抖M，但算得上科技类可玩度很高的MOD，各种发电，打板，接线，发展核电等等。而格雷科技如果想玩起来，就需要好好摸索。因为真得难。最好是从网上找找攻略学习学习。像各类机器的用途、矿物、前中后期都需要做啥之类的。反正我是没完全搞懂具体该怎么玩。 格雷科技里的一个小零件都需要你忙活半天，各种打板，制作小配件，再组装制作成一个小零件。除了需要大量的矿物外，还需要有一定耐心去摸索和等待。 模拟人生，很久前就很喜欢玩，模拟人生的乐趣就是控制你的人物进行各种日常，吃喝拉撒，工作，社交。除了这些就是，造房子，捏人。听上去就像是虚拟版且单机的地球OL。是比较有意思，但久了可能会腻的一款游戏。 但模拟人生这款游戏开启了我对模拟经营类游戏的喜爱，虽然玩的并不是很多。 GTA类游戏，开放性世界，地图不小，GTA5算是目前我觉得很好玩的游戏。游戏可玩度与自由度都很高，除了主线、支线或随机事件外，还有许多可玩的小游戏。不仅如此，还可添加MOD车辆，地图，人物等等等等。 不过，R星近期出的荒野大镖客2，更能吸引我的眼球。风景优美，游戏细腻。 只可惜，我没有PS4或XBOX游戏主机。第一代没有出PC版，不知道这一代会不会出呢？期待一下！~","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"游戏","slug":"游戏","permalink":"https://www.iloveyz.com/tags/游戏/"},{"name":"单机","slug":"单机","permalink":"https://www.iloveyz.com/tags/单机/"}]},{"title":"名侦探柯南与蜡笔小新剧场版","slug":"名侦探柯南与蜡笔小新剧场版","date":"2018-11-20T14:44:26.680Z","updated":"2019-03-05T17:00:55.412Z","comments":true,"path":"17117/","link":"","permalink":"https://www.iloveyz.com/17117/","excerpt":"名侦探柯南与蜡笔小新都是小时候的回忆，这两位主角也是永远长不大的天山童老，一个是走哪哪有命案小孩身体头脑发达的犯罪克星，一个是色色的却又充满正义与正能量的反面教材。两个都是我喜爱的。","text":"名侦探柯南与蜡笔小新都是小时候的回忆，这两位主角也是永远长不大的天山童老，一个是走哪哪有命案小孩身体头脑发达的犯罪克星，一个是色色的却又充满正义与正能量的反面教材。两个都是我喜爱的。 这两部动漫不论是番剧还是剧场版，我全看了。不过柯南还一直在更新可能900来集之后的就没继续看了，回头可以补上。而蜡笔小新不知道啥时候更新新的一季，还在等待中… 名侦探柯南零的执行人 名侦探柯南第22部剧场版 - 零的执行人 今年新出的，一开始网上的是韩语中字，实在有些受不了，就没有看，直到出了日语中字才下载下来看的。感觉这部要比上一部精彩程度提升很多，豆瓣的分要比我预期的8分差很多。不过也预想的到，估计主要问题在于各种不科学反牛顿，安室透无敌车技上吧。 哈哈，排除以上，其它还是不错的。{:二哈:}，具体的如果感兴趣可以去豆瓣看影评或是去观赏电影。 蜡笔小新功夫男孩 蜡笔小新：爆盛！功夫男孩〜拉面大乱〜 这部剧场版名字贼长，看到功夫，可能就能想到与中国有关。这次以中国功夫为背景展开的剧情，蜡笔小新仍然很搞笑，加上浓郁中国风。看得很舒坦，很轻松。我很喜爱啊。不论从搞怪幽默还是感情方面都很饱满。在上一部结尾看到今年这部的一点点预告时就很期待了。果然，蜡笔小新还是在不断给人满满地惊喜与诚意。 凑着字数写完两段非影评的观后感，顿感轻松。我果然还是看就完事了。但不写又觉得少了些啥。毕竟都是自己期待的电影，哈哈。{:哈哈:} 其实蜡笔小新我还没看完呢。但我仍然觉得是部不错的动漫电影。之后还有哆啦A梦：大雄的金银岛等着我去看呢。- -。看得动漫不多，现在一看多数都是小时候的回忆啊。 下面附上名侦探柯南与蜡笔小新种子的下载地址。小小的提示一下，因为迅雷下载对版权的控制，如果遇到什么因版权的要求，已禁止下载这类blabla的字眼那就得自行寻找方法下载了。 蜡笔小新与名侦探柯南剧场版720P & 1080P - 随心选择 efig 如下载遇到网盘提示过期或地址有误，请评论留言，我会第一时间补链，谢谢！~ 温馨提示蜡笔小新为国语中字（台配），名侦探柯南是日语中字…","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"动漫","slug":"动漫","permalink":"https://www.iloveyz.com/tags/动漫/"},{"name":"剧场版","slug":"剧场版","permalink":"https://www.iloveyz.com/tags/剧场版/"}]},{"title":"什么？折腾的味道很迷人...","slug":"什么？折腾的味道很迷人...","date":"2018-11-18T16:51:41.827Z","updated":"2018-11-20T14:38:48.369Z","comments":true,"path":"29859/","link":"","permalink":"https://www.iloveyz.com/29859/","excerpt":"以前在玩wordpress时，添加了一些可有可无的功能，像什么视频，小说，下载。除了折腾成功的那种成就感外，似乎平时写文章时很少用到。哈哈，主要还是折腾的那种快感。非常棒的。最近就心血来潮，把下载功能搬到了博客里…","text":"以前在玩wordpress时，添加了一些可有可无的功能，像什么视频，小说，下载。除了折腾成功的那种成就感外，似乎平时写文章时很少用到。哈哈，主要还是折腾的那种快感。非常棒的。最近就心血来潮，把下载功能搬到了博客里… 其实就是个下载有样式的下载框而已，看起来像那么回事。 效果如下 火狐浏览器30.71MB epsswpym 如下载遇到网盘提示过期或地址有误，请评论留言，我会第一时间补链，谢谢！~ 弄完之后才发现，这个居然高度有这么高。不过样式倒是不打算再调整了，挺好。哈哈！~{:扶眼镜:} 这个下载其实就是使用了以前文章提过的自定义标签，超好用。&lt;% 自定义标签名 参数[可选参数] %&gt;就是这个。 实现思路首先，我们要有个大致的样式框架，至少要知道哪些是自己需要的。比如，软件预览大图，软件图标，软件的大小，以及下载地址和提示信息。没错，这些就是字段了。把这些通过数组进行分组一一对应之后，剩下的就只是在文章中填充这些字段的信息即可。 其实没啥难度，主要的就是要循环下载链接，因为可能链接不止一个，如百度网盘，迅雷这些下载链接。就需要去循环填写了多少，并用split进行分割，再for循环去循环链接。只要填写就会出现一个链接。最烦躁的是百度网盘，因为分享链接带网盘密码。所以就需要多一个字段去对应。因为之前需要区分不同链接的对应关系，我把百度网盘给的class是bd，所以，我们由此去判断就好了。如果分割的class里有bd，就在链接里添加上网盘密码（前提是你写了网盘密码这个字段）。 关于样式我之前在wordpress里弄的下载界面不是现在这样，而是带有简介和图片可左右翻动预览的。但后来想想，当前是在文章中，图片预览和简介自然会出现在文章中，所以就作罢了。以前相当于现在下载站中的独立下载页面了。不想弄成那样的，所以就简单的处理了一下，只保留了一张软件预览。其它只有下载信息和下载地址。 感觉够用，就不往弄复杂了。还是可以的，至少简单够用，也去兼容了响应式。唯一不足的就是占地面积略大。{:二哈:} 题外之前使用自定义标签来获取豆瓣书籍和电影。发现需要在文中写成&lt;% douban id %&gt;&lt;% enddouban %&gt;太过麻烦，于是在弄下载时，发现可以不用写结束标签。就整改了下代码，还好没有太多引用豆瓣的东西，不然真是改疯了{:笑cry:}，git里全是错误提示，哈哈。 又稍微的调整了一下手机上显示豆瓣，文章以及下载引用的样式。看起来和谐多了。对了，还有首页底部的版权信息样式。顺便把表情更新了一下，用的就是新浪微博的2018新版表情？主要还是之前那个外链图库好像不太稳定，不是速度慢就是显示不出图片。 目前所用图库主要还是新浪的，可以外链，支持https，并且有chrome扩展，使用非常方便，可管理，可缩放图片大小，还支持批量上传。唯一不足的就是对*.png图片支持不好，会自动变成*.jpg。其它方面，除了好用挑不出啥缺点。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"折腾","slug":"折腾","permalink":"https://www.iloveyz.com/tags/折腾/"}]},{"title":"新主题，开始新的博客记录...哈哈！~","slug":"新主题，开始新的博客记录...哈哈！~","date":"2018-11-15T17:20:45.140Z","updated":"2018-11-18T16:52:47.286Z","comments":true,"path":"18518/","link":"","permalink":"https://www.iloveyz.com/18518/","excerpt":"最近一直在折腾新主题，其实谈不上折腾，只是简单的在原来的基础上修改了一下样式。比起以前的基本上弄的更简单了。然后代码还是那些…","text":"最近一直在折腾新主题，其实谈不上折腾，只是简单的在原来的基础上修改了一下样式。比起以前的基本上弄的更简单了。然后代码还是那些… 其实主要是懒得删除不使用的代码，这就比较尴尬了。其实当前这套主题是第二套，因为第一套感觉不像那么回事，而且手机版越看越别扭。同样都是一屏显示，就是感觉少了点啥。所以第二版的诞生也成了一份需要做的事情… 关于第一套主题…第一套主题采用了# yanm1ng，主要还是想要自己的修改的主题，于是，后来经过我精心的改版，也算是成型了，并且我用了很久。还是很有成就感的。虽然样式简单，但毕竟自己花了一些心思。 后来在bitcron继续使用了这个主题，这次的改版，纯粹为了庆祝回归hexo，别的就没了，算是心血来潮，一时兴起。没有把大多时间用来设计新主题。 新主题就像之前说的，我一开始用PS简单的做了一套主题。单屏无滚动。而且一页只有一篇文章。一开始看着还挺不错。后来越看越觉得别扭。于是第二套主题也就是现在用的诞生了。其实这套主题也没啥亮点。 一开始准备弄成swiper那种切换的，但想想就麻烦，于是就作罢了。哈哈。{:扶眼镜:} 题外台式机的无线接收器不是丢包就是玩游戏ping值太高，或就是没网，需要去掉重新插，实在生气，于是从网上买了个扁网线，成功联网。扁网线比起圆网线的好处是可以很轻松的从门缝穿越，棒棒哒！~{:亲亲:}","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"折腾","slug":"折腾","permalink":"https://www.iloveyz.com/tags/折腾/"}]},{"title":"成功迁移博客，其实就是换了台电脑...","slug":"成功迁移博客","date":"2018-11-08T17:18:02.191Z","updated":"2018-11-09T15:24:54.983Z","comments":true,"path":"30705/","link":"","permalink":"https://www.iloveyz.com/30705/","excerpt":"距离上篇文章好像也是很久之前了，中间断更的原因不是别的，主要还是因为我的小笔记本成功的被我折腾坏了。具体怎么坏的，我就不说了。哈哈…","text":"距离上篇文章好像也是很久之前了，中间断更的原因不是别的，主要还是因为我的小笔记本成功的被我折腾坏了。具体怎么坏的，我就不说了。哈哈… 现在是换了台新电脑，从笔记本换到了台式。还是不错的选择。配置也高了，又可以开始折腾了。 迁移博客…我没有按照网上说的去建立分支，虽然那样很方便，也便于备份和日后的更新，但我写博客还是在家。加上我看不太明白，就没有折腾了，主要还是为了不把数据整没了。毕竟都是一点点自己研究出来的东西。还是不愿去瞎折腾的。{:扶眼镜:} 我其实就是用了最简单粗爆的方法，复制hexo全部文件到新电脑。然后安装git和nodejs。之后再安装hexo环境npm install hexo-cli -g。没错这就可以了。然后就是排查问题，可以使用，hexo clean --debug，如果有问题会直接告诉你的。 我遇到的小问题… 就是nodejs版本相关问题，之前一直是旧版本，所以安装了全新的nodejs之后就会出现有些语法无法正常兼容。你所要做的就是更新不兼容的部分。首先会出现个什么sass，安装更新就完事了。npm install node-sass，如果安装不上，这时就需要用国内的镜像源，使用淘宝镜像源进行安装。先npm install -g cnpm --registry=https://registry.npm.taobao.org之后再cnpm install node-sass进行安装。 如果是你之前安装的插件（上面说的是hexo默认文件）出现不支持，就直接更新就好了，npm install 插件名称 --save，如果出现N多错误，这时可以选择cnpm install 插件名称 --save尝试去解决。 当然，如果还是有错误，或你无法解决，你可以选择安装旧版nodejs或删除出错的插件。啥？还出错？请自行搜索一下。我也不清楚了… 然后…之后，解决所有问题，就需要给新电脑添加ssh。搜索：github ssh，会有一堆，我就不再重复了。我的hexo是放在github和coding的，当前没注意，弄了半天的密钥。结果原来是coding的密钥没有修改，简直了。庆幸的是，还算顺利，没有出现其它错误。 回到hexo的感觉真不错。又可以再一次的更新博客了。{:哈哈:} 题外换了编辑器，从sublime换到了vscode，两款都是不错的编辑器。sublime更快速，vscode也挺方便（至少安装插件很省事）。{:挖鼻:}，而且对markdown支持也不错，sublime虽然支持，但感觉别扭。所以先用着吧。","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[]},{"title":"博客成功转移coding及绑定域名，还有专题新鲜出炉...","slug":"博客成功转移coding及绑定域名，还有专题新鲜出炉...","date":"2018-08-10T13:50:05.000Z","updated":"2018-08-13T14:19:32.628Z","comments":true,"path":"15850/","link":"","permalink":"https://www.iloveyz.com/15850/","excerpt":"最近一直在折腾，Valine，虽然没整出啥名堂，但是还是有成就感的。毕竟把邮箱给弄出来了。这就是成就感啊。哈哈，喜欢折腾出自己想要的那种感觉，非常的爽…","text":"最近一直在折腾，Valine，虽然没整出啥名堂，但是还是有成就感的。毕竟把邮箱给弄出来了。这就是成就感啊。哈哈，喜欢折腾出自己想要的那种感觉，非常的爽… 关于从Github转移hexo到Coding我成功的从Github转移到coding，实在忍受不了GitHub那乌龟一样的速度，毕竟国外的不靠谱，还是转回用国内的，于是从网上找，有个类似的码云，但是总感觉驾驭不了和不习惯，于是决定继续找。后来想到还有coding。之前有过接触，那跳转实在烦躁，就搁置了一段时间。 后来经过接触才发现，原来可以在底部加链接可以去除跳转，这就非常完美了。于是，果断从GitHub转到coding，过程不复杂，甚至说异常简单。我也就只是申请了coding以及修改了hexo_config.yml里的repo，仅此而已。这下，GitHub和coding一起用。非常优秀，瞬间向我气质又靠拢了一些。 具体的食用方法，建议百度，算了，直接放上链接，# hexo干货系列：（四）将hexo博客同时托管到github和coding - 来自cnblogs作者：胖逆的嘟嘟，非常感谢这位胖先生。 之后正好手头有个绑定在bitcron的域名，反正转回hexo就索性把域名也绑定了一下。任性中带点骚气的感觉。{:doge:} 于是，就这么随意+洒脱的把域名也绑定上了，可恶的是coding只支持cname，导致阿里云送的企业邮箱的mx冲突了，因为@这货。算了，反正不是多重要。企业邮箱其实只为装B装的更明显些，倒也不必在意这些细节。{:扶眼镜:} 关于专题插件…这个插件属于为本站量身定制，因为被我写的我自己都看不下去。但目标达成，之前一直想着的这事终于搞定，也算可以的，优秀是肯定的，太优秀就有点说不过去了。{:挖鼻:} 专题插件参考了hexo自带的hexo-generator-tag，在弄之前，因为不知道如何加载，然而问了一圈也没人告诉我，于是我就自己试，这里注意，请拿笔记，我要圈重点了，就是hexo根目录有个package.json不知道你有没有，反正我是有的，请用编辑器打开，随便什么编辑器。在里面按格式添加上你的插件名称和版本。到这里就OK了，当然你需要手动去node_modules创建个以hexo-开头的插件名称，这里的名称要和package.json里的一致哟，版本也是。然后去你新建的这个文件里npm init按提示操作就可以了。 官方说，必须得有name插件名称，main也就是index.js自己建立个，然后就是version版本。 然后就请开始你的表演，敲打出振奋人心美妙的代码来构建属于你的插件。 相关问题 提示问题有不少，但又怎样，被我一一解决。什么控制台报一万个错误，按着提示去弄，不是太难。我觉得难点在于不提示问题，而东西却没有完成。 在我优秀的逻辑和思维模式下，很快就构建好了思路及写好了插件，成功的使我指定的文章出现在了以/topics/巴拉拉小魔仙来访问。也就是说成功了。这时我并没有骄傲，因为我知道，还有问题等着我。于是擅于发现问题的可爱迷人的小眼睛发现了问题。 在我建立的topic.ejs文件下，page.posts.each提示我报错，看到这错误我差点爆了粗口，最终被我善良的理性给压制了。心平气和找原因，结果，我发现了，原来是_config.yml配置给写错了。topic没有加s，去掉之后，里面成功。 注意这个错误，本地预览是正常的，需要hexo g之后才会提示错误。所以，我就机智的想到了配置文件。这里请响起掌声。 解决这个难题后，一切都变的异常简单，因为只剩样式了，于是我很快就完成了。在当前专题下获取当前专题名称可用post.你定义的名字即可，如果想获取当前页面文章数量，只需要page.posts.length即可，当然，&lt;%%&gt;还是要加的，不然你打什么输出什么，绝不含糊。 像专题的图片和介绍都可以随意更换，我都给写到了_config.yml里，我在插件里写了循环，只要专题ID或名称正确即可匹配对应的图片和介绍。 这些弄完之后，走在街上，大家都张灯结彩，给我发来了贺电（假装一下）。 专题和分类以及标签都类似，就是在postmeta写上，名称：专题名称，文章就可以直接被拉取到该专题下，方便好用。 这样一来，查阅就更加方便了。而且，可以指定多个专题拉取一篇文章，这样大家都有的分，就不用打架了。还是不错的，实用，更清晰。 具体的演示，请看本文最下方，被以下专题收录，嗯嗯，和我上一篇截图基本一致，都是参考了简书的样式和写法。这个专题，我思前想后还是决定只放在普通文章里，像长文章本身就够当个专题使用了。所以就不去凑热闹了。而视频页面纯属娱乐的产物，就也不弄专题了。以后等我研究透了video以及找到好的可以承载视频的外链，到时会把video给重新弄一下。 嗯嗯，就到这里，差不多啰嗦完了…","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[]},{"title":"日常折腾与日常，标题要随便又优雅...","slug":"日常折腾与日常，标题要随便又优雅...","date":"2018-08-05T13:59:55.000Z","updated":"2018-11-18T16:39:15.655Z","comments":true,"path":"22825/","link":"","permalink":"https://www.iloveyz.com/22825/","excerpt":"其实主要是做个记录，博客单机的好处，可以随心所欲的想写什么写什么。毕竟就自己看看，就算是黄段子也不会被和谐，下面就进入正式的黄段子…记录环节","text":"其实主要是做个记录，博客单机的好处，可以随心所欲的想写什么写什么。毕竟就自己看看，就算是黄段子也不会被和谐，下面就进入正式的黄段子…记录环节 最近一直在折腾valine评论，来回折腾其实也就弄了个邮件样式。其它啥也没弄，可以说是没弄成，只能说自己的技术还是不到位的。 一开始是准备把@name给弄成可以编辑的，发现太难了。代码能看懂，不知道如何去修改。这就很不爽了。还是学习的不到位啊！~所以最后为了使自己折腾的有存在感些，就把邮箱通知的样式给弄了一下。这也不枉费一番折腾。 每次去百度东西的时候，都是比较羡慕那些自己折腾的人，因为他们都会说。 因为自己需要某些功能，因为自己懒去网上找，没有合适或无果，就自己简单写了下就弄出来了。 看完类似这样的言论，真是觉得自己是在和泥巴，别人都已经在弄冰雕了。{:捂脸:}，只能怪自己技术不行。所以我一般选择鼠标默默地移到右上角，不BB。当然，像我这么爱学习长得又帅的，大多情况下都是去埋头学习的。 最近有种想学习nodejs的冲动。我还是想把专题给弄出来。就像简书里那种。等等，我去开QQ截图。 啊，我的写轮眼，你别（中二），到时我想弄成这样的，多酷。到时还有个专题列表。虽然像极了分类，但又区别分类而又高于分类。 优点：使文章分类更清晰，东西一看就知道属于哪个专题的。帅的一批又不失优雅，简单中又不显单调 缺点：我需要学习nodejs… 毕竟是个菜鸟，不学也只能看看，而自己无从下手，回想起折腾hexo以来，从懵懂到未知，再到完全懵B。这是一个神奇的过程。也没有这么夸张。 还是有成就的，像什么文章中引用站内文章的独立好漂漂的样式这样，以及从增加阅读数突然想到的点赞美滋滋功能。还有就是必须好长的文章才能写的长文章。一步一脚印，还是有点成就感的。再之后的就是豆瓣电影和书籍在文章中显示（抄自bitcron）… 具体请翻阅本站第5条275章第6小节有介绍… 果然还是有颗不断想折腾的心...2018-07-25 22:10:50 喜欢hexo折腾起来的感觉 最近不知为何心血来潮，又想着折腾下hexo，毕竟喜欢折腾，喜欢折腾的感觉，受虐型的那种，基本上已经脱离了... 不对，好像跑题了，明明是做记录的，怎么跑到自我好评了。 回归正题，上回书说到黄段子，最近我在看一部AV…额，额… 什么来着，对了，valine的邮件评论，真是把我折腾够呛。还好我之前弄过一个，但样式来回测试差不多，我数了一下，大概，应该，也许有一万多个邮件。请看… 你看，我没有骗人吧，我向来都是这样…这个邮箱可是我新申请的。就是为了测试用的。 最终，我弄出了如下的邮箱通知样式… 这是以前现成的，我就拿过来用了，没有多做修改，还行。感觉够用。我就测试了一个QQ邮箱，其它邮箱没怎么，没测试过。 不过邮箱里还是有所限制的，像什么外链的图片都会被javascript:;所替换，所以里面的外链图片会不显示，本来想把我果照放里面的，可惜了… 不过弄完之后，还是有成就感的，毕竟折腾… 下一折腾，将研究一下，前面说的专题，这是需要放上日程的，因为爱学习的我今晚都准备通宵看教程了，当然，要不是我才剪了指甲我肯定就通宵看nodejs教程了，像我这么爱学习的。可惜了… 算了，既然如此，那就搁一边儿，先写写博客吧，说不定哪天，我梦游的时候就完成了也说不定。毕竟自恋…优秀！ 不知道为什么，每次写博客总想把最近看的电影之类的放博文里凑字数写一写。好吧，既然大家都这么期待，其实就我一个最期待，那我就受累写一写吧。 说到电影，我就来劲了，我最近看得是，回到明朝当王爷。 什么？之前我说过，那本文就此结束，再见…","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"修改修改，主题就是要美观才好看！~","slug":"修改修改，主题就是要美观才好看！~","date":"2018-07-30T15:17:20.000Z","updated":"2018-08-04T17:00:49.296Z","comments":true,"path":"39607/","link":"","permalink":"https://www.iloveyz.com/39607/","excerpt":"嘿嘿，作为不折腾不舒服斯基，还是没事的时候折腾一下更显得是那么回事些。其实也就是日常的CSS样式的修改，基本没有其它。对了，这次修改的内容还包含了一个评论。","text":"嘿嘿，作为不折腾不舒服斯基，还是没事的时候折腾一下更显得是那么回事些。其实也就是日常的CSS样式的修改，基本没有其它。对了，这次修改的内容还包含了一个评论。 最近这两天，github访问速度似乎又正常了，速度快了不少，至少生成页面速度也快了，一口气也能上六楼了，腰也不酸腿也不疼了。如同吃了成长快乐般，又可以愉快的更新博客了。哈哈。{:doge:} 关于评论从评论gitalk变成# Valine，前者是基于github而且必须使用github帐号登录后才可以进行评论，而且有时还会出现未加载成功或是一些JS上的错误提示。还有就是加载速度感人。 所以经过上述一些使用上不是很习惯的态度，试着百度搜索静态博客评论就搜到了# Valine这个评论系统，评论的数据是存放在# Leancloud上的，这下就省事一些了，因为我的点赞和阅读数量都是在# Leancloud上的。这样以后就可以统一管理了。 一些小问题 # Valine在安装上是相当方便的，只需要引入JS和放置评论DIV在文章页并把# Leancloud上的APPID填写正确就可以正常使用了。 具体方法我就不说了，官网说的非常清楚。出的小问题就是，我一开始使用错了# Leancloud的APPID，导致数据无法正确加载出来。 比如，你在之前使用了# Leancloud的文章阅读数量后，需要把Comment字段新建在与文章阅读Counter一个应用下。之后就可以正常使用了，之前我也是弄错了另一个APPID，所以弄的可以提交无法显现评论的数据。很郁闷，然后就跑去# Valine提问，作者很认真的解答了疑问（真是良心作者）。 # Valine的好处不仅与此，还可以更改样式。非常良心。结构似乎也可以通过在JS里修改。没有深究，不做太多说明。 关于样式的修改上面之所以这么多的链接，主要还是为了这篇文章发布后对链接样式调整。嘿嘿！~{:害羞:}，我要改成跟随潮流的链接样式。 然后就是评论样式的修改，因为自带的样式就很干净好看，所以没费啥劲，就改了下颜色和评论按钮的位置。 关于页JS里样式调整。还有就是把字体从微软正黑改为微软雅黑。 其它就没啦，非常优秀呢！~ 题外一直想把主页弄成只有一屏的显示方式，就简单的一个标题，但一直没啥好点子，就又继续搁置了，以后闲下来，好好研究一下。把主页弄的更简约一些。有些审美疲劳这种列表形式的了。还是觉得越简约越好。{:嘻嘻:}","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"果然还是有颗不断想折腾的心...","slug":"果然还是有颗不断想折腾的心...","date":"2018-07-25T14:10:50.000Z","updated":"2018-11-18T16:37:36.785Z","comments":true,"path":"1096/","link":"","permalink":"https://www.iloveyz.com/1096/","excerpt":"喜欢hexo折腾起来的感觉最近不知为何心血来潮，又想着折腾下hexo，毕竟喜欢折腾，喜欢折腾的感觉，受虐型的那种，基本上已经脱离了记事写博客的初衷了。尽想着折腾些新花样。","text":"喜欢hexo折腾起来的感觉最近不知为何心血来潮，又想着折腾下hexo，毕竟喜欢折腾，喜欢折腾的感觉，受虐型的那种，基本上已经脱离了记事写博客的初衷了。尽想着折腾些新花样。 然而技术不到家的我，仍然是一脸懵逼的打开github，来回找回曾操作的感觉，什么git，生成ssh一系列操作后。果然，仅仅是心血来潮啊！~嘎嘎。好多东西都忘记了，甚至忘记了hexo的语法，这就很尴尬了，不过仍然要吐槽hexo的便利性，实在是效率低下。 我大概写了也仅仅只有28篇文章而已，就已经生成到上传需要5-10分钟左右。 github在我大天朝的访问速度也是龟速中的龟速，可能也有一部分这个原因吧。真是想转战别的地方来搭建hexo。 一开始想着在国内找一个类似的，像什么码云？coding，可后来还是没有转战，嫌麻烦，怕到时改的东西太多，或整不好。 毕竟hexo的便利性太差，多台电脑更新或修改博客实施起来也困难，各种删除一些文件，和使用一堆git来上传生成，想想就麻烦啊。（注意，这时已经严重偏离主题以及与折腾相矛盾）。 如果当初不是选择折腾了hexo，可能早早的就转战hugo或国内了。 真的是又爱又恨的感觉… 到hexo自然需要添加些新东西…我把豆瓣的电影和书籍给弄过来了，就是在文章通过写上豆瓣电影的ID和书籍的ISBN来显示在文章中，虽然平时用豆瓣不多，也不影评，但是基本上看电影都是通过豆瓣的评分和评论来决定看不看这部电影的。所以也算是使用上的一种便利。 嘿嘿，一开始不知道如何弄，因为需要通过电影ID获取电影在豆瓣上的相关信息，就需要在文章中以填写ID，这就把我难住了，后来想明白之后，就想到了一个好办法，通过类似post-link相同的方法，在文章中以自定义标签来填写ID，再用JS获取这个ID的值来实现，在我尝试了之后，果然，成功了。 然后就是修改样式，弄成了和post-link自定义标签一样的样式。 效果如下 电影&amp;电视剧 书籍 嘿嘿，效果不错，很有成就感。 最近在玩儿《泰拉瑞亚》泰拉瑞亚是款横板单机游戏，可以通过IP或者STEAM进行联机，对于我这种手残党来说，能勉强通关就不错了。不过游戏倒是不错的。可以一玩。 最近在和老弟联机加了mod的泰拉瑞亚，的确增加了许多趣味性，不仅是在装备，物品，NPC，地图，怪物等等进行了改进和增加。连难度也增加了不少。 在原版中，毕业BOSS是月总（具体名字忘记了{:扶眼镜:}）。而在mod中，月总也仅仅算得上是个精英怪而已。更加强的BOSS在月后更是层出不穷。 基本上不熟悉游戏以及mod的，基本不知道如何进行，我就是一直处于懵逼状态。不知道下一步该干嘛。所以，这就导致了，我只负责一起打打BOSS啥的打个酱油。只能算是熟悉mod了。 上班边专(bu)心(wu)工(zheng)作(ye)边听小说之前看了几年的小说《极品家丁》（以下简称家丁）看和听完之后百无聊赖，于是我又找了本，有些古老的同为穿越小说的《回到明朝当王爷》（以下简称回明）。回明与家丁相同，都是穿越+YY+种马类小说。如果说家丁偏文艺，那回明权谋的元素更多一点。只不过家丁相对于回明，更为YY一些。 我看过的小说屈指可数，像什么《史上第一混乱》，《邻家有女初长成》，《纨绔子弟》，《坏蛋是怎样炼成的》，也就这几本。《盗墓笔记》看了三分之二左右，《鬼吹灯》就看了前几章。主要还是听的多一些。小说不是我的爱好，最多是无聊打发时间的产物。所以基本上，一本书断断续续，我可能需要看很长时间。毕竟不专业看小说的。哈哈！~ 其中，最可惜的是《邻家有女初长成》被和谐了，所以太监了。网上倒是有网友接着杜撰的，但是总感觉不是作者写的，就没有去看过。 我估计回明我又得看个很长时间，不过换言之，上班的时候如果天天听，500章左右的小说也许能很快看完也说不定呢。我才看了两天就看了60章了，一天三十章的进度，差不多一个月至少能看个500章左右。还是有点意思的… 迷之结尾其实这个文章一开始准备写好长的，结果写着写着不仅偏离了主题，而且还不务正业的冒出N多整改hexo的想法，然后又跑去修复一些BUG，新增一些可有可无的样式，结果就耽误了很长时间，于是今天补完这篇，算长也不短的“长文章”。 hexo还是方便的，比起bitcron自由度要高一些，毕竟可以接触到底层代码，想修改起来也是可以的。除了不能随时更新和修改博客以及github国内访问速度太慢外，其它还是不错的。今天空闲之余我又去弄了下hugo，虽然速度很快，但是还是感觉用起来别扭。所以就这样吧。 也不转战码云了，还是觉得github比较熟悉和稳妥些。","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"日常折腾和日常...嘿嘿...","slug":"日常折腾和日常...嘿嘿...","date":"2017-12-25T01:31:17.000Z","updated":"2018-08-10T15:05:19.900Z","comments":true,"path":"10208/","link":"","permalink":"https://www.iloveyz.com/10208/","excerpt":"感觉更像是记录折腾笔记，把手机版的首页文章展示方式做了修改，原来是一张图加标题。现在改成一图一标题还有分类与浏览次数…","text":"感觉更像是记录折腾笔记，把手机版的首页文章展示方式做了修改，原来是一张图加标题。现在改成一图一标题还有分类与浏览次数… 基本上除了这些就没啥可改动的了… 最近因为需要番羽土啬，苦苦找寻，倒是找到一个VPN，# FreeVPN(访问需自备梯子)… 不知道为什么，WINDOWS7下使用PC版，一直都点不了，而谷歌浏览器的扩展插件虽然可连，但所有线路都试了，似乎不起作用。 不知道是我的问题还是软件的问题，不过安卓上倒是挺好用的。速度也还行。但电脑上用不了这就有些烦躁了… 而且好像就算连接上VPN，P站也上不去…不知道为什么… 所以经过以上尝试后，我决定自搭一个SS。去百度搜了下，就搜到了搬瓦工…去官网看了，价格实惠，适合像我这样VPN使用不多且用量不大的人使用。 虽然限制流量，但500G/mo足够…就是不知道速度如何，对我来说只要720P可以看着不是特别卡就非常不错了，可以研究一下…","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"喜欢上写作，我是要成为散文大师的男人...","slug":"喜欢上写作，我是要成为散文大师的男人","date":"2017-12-23T02:58:52.000Z","updated":"2018-07-25T16:52:52.843Z","comments":true,"path":"49797/","link":"","permalink":"https://www.iloveyz.com/49797/","excerpt":"经过这两天的折腾，没错，又在说折腾。越来越喜欢写作，不仅把功能实现的贴合我的使用习惯，经过这两天的更新，使我也越来越喜欢写作…","text":"经过这两天的折腾，没错，又在说折腾。越来越喜欢写作，不仅把功能实现的贴合我的使用习惯，经过这两天的更新，使我也越来越喜欢写作… 我的写作水平最大程度上也就是小学水平吧（可能都不及）{:思考:}，小学也就会写个让座什么最难忘的事。想来似乎除了小学外，其余就是考试才会写作文。我也毫无保留地把所有写作技巧全部还给老师了。为了不给语文老师丢脸，我决定，以后就说自己的写作水平是体育老师教的（体育老师：关我diao事…）。 对于写作，按照路飞的经典语录就是，我要成为散文大师的男人…不过想想就知道是多难，虽然按照我的天分和稳重，有魅力等省略10W字左右，应该会很快到达登峰造极的水准。不过为人低调谦和的我，却只愿做个靠颜值不靠文学的人。{:捂脸:} 跳跃今天想申请个京东云来玩玩的，无奈，时间错过了。罢了周一再说，嘿嘿！~{:害羞:}，其实也不知道京东云申请来做什么，游戏服务器？MC服务器？未知…就想弄个玩玩而已…{:挖鼻:} 再跳最近LeanCloud时常抽风，时好时坏的，真是怪要命的，有句古话怎么说了着，“免费的没有一个好用的东西…”真是形容的非常贴切的…","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"小小的折腾一下懒得设计文章配图的样式...","slug":"小小的折腾一下懒得设计文章配图的样式","date":"2017-12-22T14:15:35.000Z","updated":"2018-08-08T16:02:57.211Z","comments":true,"path":"31120/","link":"","permalink":"https://www.iloveyz.com/31120/","excerpt":"仅是小小的折腾一下，其实一开始就想着如果没有图就会有些别扭。所以索性再稍微的修改一下，把和普通文章稍稍的区分一下…","text":"仅是小小的折腾一下，其实一开始就想着如果没有图就会有些别扭。所以索性再稍微的修改一下，把和普通文章稍稍的区分一下… 当然，也可以照常规显示无图，如下图所示 而右侧图文的图片，则是自动获取文中第一张图片来显示。大致的顺序为。文中第一张图 &gt; 自定义banner图 &gt; 默认图片。 感觉还行，至少以后懒得做图的时候，只要文中有图就可以直接获取了，省不少事（这一举措以后可能都会以这种形式显示…）。 hexo的可控性还是很强的嘛，想想也是挺厉害的，从一开始的啥也不懂，到现在的稍稍入门（其实懂得也不多）{:挖鼻:}。也算有成就感… 老夫还是很欣慰的，{:扶眼镜:}… 其实文章配图不仅是为了好看，更主要的还是让内容更饱满，显得内容更丰富些，也是以前的习惯。久而久之，就觉得文章就得有个图。 这两天，懒得开PS，就觉着是时候再小小折腾一把了… 最近喜欢跑# dribbble研究别人的设计，国外大神挺多，也激发了不少灵感，其实想制作个新主题。却一直没啥好想法，今天虽然激发了不少灵感，但打开PS又懒得做了。 之后，点开浏览器，输入小站的地址，觉着也不是不能看，于是乎，就决定不做新主题了。等哪天想弄的时候再说吧… 今天去网盘找东西，偶然发现以前所设计的LOGO。下载下来看了一下，还是挺有感觉的… 从左至右，第一个，是我和弟弟们的姓氏，主要用于QQ群做群LOGO使用，是个英语学习群。 第二个和第三个，是用来展示漫画和设计作品的站点LOGO，为了使其看上去不同一些就做了两个。 最后一个，是我不知道从哪想的名字，就试着做了一下。有那么点儿意思。嘿嘿！~{:扶眼镜:} 文章结语发现没，我写的文章是跳跃且基本不贴合标题及主题的，就像在泥坑里跳来跳去。这就是到达一定境界后的写作风格…{:扶眼镜:}，是那么的洒脱与不羁…","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"折腾","slug":"折腾","permalink":"https://www.iloveyz.com/tags/折腾/"},{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"我的日常与暂定居hexo静态博客...","slug":"我的日常与暂定居hexo静态博客","date":"2017-12-21T14:33:06.000Z","updated":"2018-07-25T16:52:57.111Z","comments":true,"path":"51120/","link":"","permalink":"https://www.iloveyz.com/51120/","excerpt":"思来想去，还是决定暂定居hexo，其实在昨晚就想好，转战回bitcron，但暂时先不考虑的原因，其实还是觉得折腾了那么久的hexo，实在有些不妥…哈哈…","text":"思来想去，还是决定暂定居hexo，其实在昨晚就想好，转战回bitcron，但暂时先不考虑的原因，其实还是觉得折腾了那么久的hexo，实在有些不妥…哈哈… hexo使用久了，其实发现所谓的不方便都是在一些小地方。因为我更新文章不定期定时。所以虽说无法随时随地更新这点，倒也可以凑合。然后就是git开启慢，其实也就是多等个一两分钟而已（至于网上说的随着文章逐渐增多，生成时因为是全站生成，会导致时间过长或变得巨慢）… 估计那时我差不多就已经转战bitcron了，所以暂时不考虑那么多，继续把老窝安置在hexo。 折腾那么久，其实也是多少有些感情的。以前转战bitcron时，并没有怎么折腾，而到了bitcron，就把hexo的东西搬运并加强了了一部分在bitcron。 真是没日没夜的，相当疲惫，- -。{:睡:}，不过倒也十分有趣。打发了我很多空闲时间… 今天本来想优雅一把，使用# typero写markdown的，而且我还把文章样式改成和我现在一样了。结果一切就绪后，发现并不能优雅愉快地写文章。因为我使用的hexo-abbrlink插件，需要保存才会生成abbrlink（固定链接文章ID）的。也可能是我操作问题，但不想特别研究，就果断卸载… 不得不承认，typero界面简约，桌面应用，可以F12使用开发者工具，自定义主题就是修改CSS。方便且优美… 可惜，我还是喜欢文章固定链接，继续用markdownpad 2，虽然我是个首先考虑颜值的人，但光有颜值不贴合使用习惯还是算了。 以前蠢了，以为hexo的.md文章都必须使用英文或拼音来命名，今天才发现不是。完全可以使用中文，蠢了好久，- -。{:挖鼻:}，而且可以使用于hexo自定义标签… 这下好了，再也不用担心找不到正确的文章来内链了（以前英文命名，我都乱取的。查找起来相当困难）…{:思考:} 最近电信老用户活动再一次把宽带升级了，从50兆升到了100兆，速度那叫…并没有啥感觉，下载还是老样子…网络上限速疯狂，动不动就限速，然后让你购买各种VIP来提升宽带至N倍。我想就算宽带到了1000兆，又能如何呢？该限制还是限制，该100kb/s你就到不了200kb/s。仍然是个小水管。 无疑对下载电影或不限速的东西是个很好的体验，至少满速下载一个东西能至少节省以前一半的时间。想想就感觉不错。 以前小水管时代，2兆网速下片儿（电影），为了看高清的都得下个一两天。那时是多渴望百兆光纤。那时的百兆基本一个月就是上千。想想现在，真是进步挺快。 所以100兆对于我来说，并没有特别的实际用处…只求不卡… 发现几处小bug，主要基于看着不爽的原则，其实就是CSS未定义好，比如，长文章页手机上如果图片无法达到手机屏幕高度，就会显示不全（具体点说应该是盖不住整个屏幕…），以及文章里ul,li列表嵌套的ul与下一个li之前的空隙不对称，也就是高度不一致。这叫我如何能忍…于是乎，改之…这问题还是我在typero里更改样式时自行研究出来的…后来一看还真是… 我发现我每次一发表文章就是长篇大论，棒棒哒！~{:挤眼:}，文采好的表现。","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"文章","slug":"文章","permalink":"https://www.iloveyz.com/tags/文章/"},{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"蠢蠢欲动，未知的冲动...","slug":"new-idea-and-untitled-1","date":"2017-12-20T07:55:45.000Z","updated":"2018-07-25T16:53:02.014Z","comments":true,"path":"54777/","link":"","permalink":"https://www.iloveyz.com/54777/","excerpt":"最近不再折腾，感觉一下就空虚了，不知所措，想制作新主题，却完全没有什么好想法。最近一个未知的冲动却蠢蠢欲动…","text":"最近不再折腾，感觉一下就空虚了，不知所措，想制作新主题，却完全没有什么好想法。最近一个未知的冲动却蠢蠢欲动… 纯粹寂寞地燥动？未知。就是想着重回wordpress，有这一想法是在最近几天，因为一直使用静态博客，所以一直都是寄居人下。又突然发现了个自认为不错的域名，而且暂没人注册。感觉极棒，不过，最后还是没有入手。{:黑线:} 其实源自矛盾心理，{:嘻嘻:}，三天新鲜，我深知自己的尿性。想折腾又懒得折腾。就是这么随性。 推卸责任其实这一切，都因为hexo，{:思考:}，不可以随时的更新文章，还需要git一下。 最近发现$ hexo g -d越来越慢了，而且启动的时候也卡得一B。 算了，准备先把域名买着，反正用不用都得有个域名。反正又不贵，以后总有用得着的时候。 到时估计回得也不是wordpress，最多是bitcron。单机博客不需要太多需求，不然就不是单机的初衷了…毕竟单机还是蛮有趣的… 最近我停留在打开PS和关闭PS之间，工作稍微闲时，就整开PS，想着新主题。随后又默默地关闭。完全没有想法也是个事。现在脑袋一直处于空白状态。无灵感，无想法… 最近工作遇到棘手事，后台返回的数据，AJAX接收需要高达2s以上，这点让我很为难。经过我的测试，最大可能是因为数据的返回的太慢。导致waiting(TTFB)过慢，不，是巨慢。 目前正在研究如何解决，不过凭借我对ajax的理解，估计很难。 看吧，也许很快就解决了呢… 文章点评我看了下上面写的，这，这不就是散文嘛？东一出西一出，变幻莫测，想想自己的写作水平，{:鼓掌:}，绝对大师水准。","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"谈谈主题，谈谈wordpress...","slug":"talk-about-theme-and-wordpress","date":"2017-12-18T13:55:22.000Z","updated":"2017-12-19T08:41:30.714Z","comments":true,"path":"62643/","link":"","permalink":"https://www.iloveyz.com/62643/","excerpt":"关于主题，我做过一些，但不多，至今没有特别完整的网页主题倒是真的，这次就不说精力有限了，其实闲瑕之余还是可以一点一点做的。还是太懒，不愿专注一件事太久。","text":"关于主题，我做过一些，但不多，至今没有特别完整的网页主题倒是真的，这次就不说精力有限了，其实闲瑕之余还是可以一点一点做的。还是太懒，不愿专注一件事太久。 使用wordpress一般都是找个差不多的主题，然后差不多的改改，改到面目全非就成自己的了，不过还是习惯性的不删除任何有关原作者的信息。除非把页面改的一点儿都不剩才会加上由本人创作。 以前使用wordpress时，会在网上找很久的主题，之后就是很难找到自己非常心仪的主题。有的好看的，但却收费而有的好看也不收费，但基本上都是英文，且需要花时间去学习这个主题，就索性不用了，所以这就很苦恼了。 后来才想着既然网上没有，就自己改吧。其实改来改去，都不是特别贴合自己使用习惯，要不就是看久了容易腻。那个时候还没有养成在制作主题前先使用photoshop先画整体结构，所以临场发挥就相当耗时耗精力。而且容易把自己所想做走样。要么就是参照别人的网站容易把风格做的不伦不类。 所以制作前的设计工作真是特别重要。 其实我还是较为喜欢wordpress多些，功能强大，免费，开源。是我使用最久的一个博客程序。我用过不少博客程序，从ASP到PHP，大多都用过。最后还是选择wordpress…除了后台打开费劲，其它都不错的。 现在不用wordpress的主要原因其实就是容易荒废，我更博三天新鲜，极其容易忘记续费，域名VPS，这些就导致了经常性的好多文章丢失，要么就是域名到期被别人注册走。 所以谨慎起见，我在hexo和bitcron之间来回游走。bitcron虽然收费，但价格实惠，虽有限制，但对于个人博客来说却绰绰有余，更别提像我这种喜欢单机的博主。而且最重要的一点是可通过dropbox同步和邮箱随时发文，这点hexo就显得特别逊色了… 之所以不继续使用bitcron，基本同wordpress，所以退而求其次，先使用着hexo。之后如果不考虑wordpress的情况下，会一直使用bitcron… 喜欢wordpress的最大原因还是因为其使用的是PHP语言，相对于hexo和bitcron。我比较熟悉，折腾起来不用耗费太多时间，上手可以更快些。 关于主题的折腾，至少得等我把未来使用的主题完整的设计出稿后才考虑的事情了。估计N年后，或者就是说说而已。谁知道呢，折腾这玩意有时候就是心血来潮，仅此而已…","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"主题","slug":"主题","permalink":"https://www.iloveyz.com/tags/主题/"},{"name":"wordpress","slug":"wordpress","permalink":"https://www.iloveyz.com/tags/wordpress/"}]},{"title":"我看过追过以及我喜欢的那些动漫...","slug":"about-watched-episode-for-comic-and-animation","date":"2017-12-17T12:43:47.000Z","updated":"2018-11-10T16:15:06.445Z","comments":true,"path":"51586/","link":"","permalink":"https://www.iloveyz.com/51586/","excerpt":"有关动漫的前言导读对于动漫，其实我看的是少之又少，我较为喜欢的类型其实也是非常有限的，最喜欢的还是比较热血且比较长的动漫。不是特别喜欢追番剧，感觉不仅看得非常着急，而且有时候忘了。","text":"有关动漫的前言导读对于动漫，其实我看的是少之又少，我较为喜欢的类型其实也是非常有限的，最喜欢的还是比较热血且比较长的动漫。不是特别喜欢追番剧，感觉不仅看得非常着急，而且有时候忘了。 所以动漫对于我来说，无非就是个心血来潮的娱乐节目。但不得不说，的确有几部动漫，是我非常喜欢看的。{:嘻嘻:} 不知道什么时候开始喜欢看动漫，但只要听了别从的介绍我都会看一看，因为我容易受剧情诱惑，只要感兴趣就会一追到底。一发不可收拾，而且特别讨厌别人的剧透。大多时候我都是一个人静静地看完，整部动漫。嘿嘿！~ 而且，一看就是一个月那种（只有晚上和相对空闲的时候），看完后，可能会连前面的剧情都忘了。{:挖鼻:}，除非是看得特别认真才会记忆深刻。 一般来说，只要我看过一遍的动漫，不论多经典绝不会从头到尾再看第二遍，特别是很长的。 今天要发这文章的时候，边写边想，发现自己虽说不是特别喜欢看动漫，却也看了不少，而且大多都是动辄上百集的，想想还真是有些恐怖。{:汗:}无形打脸的感觉有些灼热感… 注其实这个导言多余之中带有丝凑字嫌疑，但感觉没有导言直接开始又有些唐突。所以为了缓解唐突感，凑字也就理所应当… 火影忍者，初代追的动漫（番剧？）其实我不是很理解番剧何意，百度之后才知道，原来是下面这个意思 日本连载动画剧，属于二次元用户常用语 火影忍者是我正直踏入追番行列的第一部动漫，当时我还年轻，是个二十不到的小伙子。追剧的原因，大家都在看，不看不光荣。 于是按着这一套路开始追番，当初其实前面剧情没看，看着剧情也是不知所云，我那时只是为了本着大家看我也看的原则而看，并不是忠实观众，所以完全不知道都演得啥。 一个伪火影迷，仅此而已。那时大家下了课就几个人围坐一起开始讨论情节和自己的见解，听着有趣就跟着追了。 有一次还旷了课去网吧看，想想除了傻，还是傻。不然我也许已经是一位叫杰出科学家了吧。{:思考:} 那时也只是看，虽然看得云里雾里，但也觉得不错，记得是中忍考试那段，最记忆深刻的就是那玩的一手好结印以及大蛇丸对我的冲击。 主角并没有看上眼，只对大蛇丸一人着迷。后来还在上课开始临摹大蛇丸，对那时的我来说，栩栩如生…{:鼓掌:} 后来没多久，我就退出了火影圈，转战聊天旷课圈了…（我不是个好学生，好学生也从不学我）… 从那之后就没再看过火影，当然这是出于对动漫的不热爱…{:捂脸:} 不过不知道过了啥时候，就决定等火影完结再好好拾起来重头看一遍…而现在，我已经看完了鸣人那一时代的剧情…{:鼓掌:} 没错，我每晚都看，看了差不多有一个月，已经记不清每晚看多少集了…看得那是天昏地暗，中途还入了迷，每天上网查人物相关介绍。看得热血沸腾，才知道原来这部动漫原来还是非常好看的。怪不得那么多人喜欢，剧情丰富，人富个性鲜明。 我只看到世界大战，宇智波带土月之眼计划失败。本以为完结，剧情却从鸣人转到了他儿子那个时候… 我就不准备继续看了…不然就成了追番了，追番最没劲了… 火影忍者里除了鸣人外，我最喜欢的人，波风水门，卡卡西，佩恩，宇智波鼬，迪达拉，大蛇丸，小南也不错。 最讨厌的人就是小樱，没有之一… 而宇智波佐助，虽然不讨厌，但也没啥好感，只能说伟大的哥哥成就了个傻弟弟…{:思考:}，嗯嗯，这样说应该没错… 其实晓组织里我都挺喜欢的，鬼绞除外… 不知道为啥对反派这么感兴趣，哈哈。大多数人背后都有一段故事，而这故事无非就是一段冗长的回忆… 不过有的回忆我还是爱看的… 总体来说，火影是部不错的剧，虽然回忆多了点，好多剧情啰嗦了些，基本还是喜欢的，就是鸣人和佐助的羁绊，爱恨纠葛有些虐…其它都还不错，对了，鹿丸同样是我喜欢的角色之一… 评语火影，值得一看… 名侦探柯南，聪明小巧的外表下一颗看穿一切的心… 名侦探柯南，其实我小时候就在看（暴露年龄.jpg），当初看柯南只觉得画风挺不错的，同样是我上学临摹的对象。 特别是柯南的发型，怎么临摹都感觉怪怪的。画不出那种风格，特别是小兰那独角兽戳穿人不偿命的发型…{:斜眼:} 柯南的剧情套路虽然万年不变（偶尔会变一下），但整体故事情节却很有意思。每集的杀人手法无不令人乍舌。有的或许有些夸张，但给我的感觉都在情理之中…{:思考:}，而且每个故事都不一样（作者幸亏是个好人…），看着也是很有劲，会莫名觉得热血… 虽然爱看，但一直没有追过TV版，一直都是剧场版，是一部我一直看到现在仍然爱看的一部好番。 每年都出一部剧场版（基本翻剧都这套路）我都喜欢，而且都看过…特别喜欢里面的怪盗基德。其实画风和新一都是一样，除了发型…{:睡:} 没有什么特别喜欢和特别不喜欢的人，只有最喜欢的人。比如：基德，冲矢昴（赤井秀一），安室透，服部平次，京极真，大和敢助，羽田秀吉等等… 更多人物可参考此网站# 心韵动漫 - 传送门，名侦探人物关系图…（很有心的一位站长，整理的非常全…辛苦，辛苦！~{:亲亲:}） 卧槽，这一列举发现简直多，大多我都喜欢…{:害羞:} 当然这还是排除了男女主角的，嘿嘿，记得里面有一集出现了一个假冒的新一，当初还以为啥情况呢，后来才经过我成熟又稳重的推理才知道，假冒一个。 在看柯南的过程中，我也试着去根据线索推理，基本上，大多，都失，败，了…当然不是我推理的不行，而是证据给的并不是特别足，当我还蒙在鼓里的时候，柯南就一副知道一切的表情。 我就知道，我又被这小子领先了，算了，虽败犹容…{:捂脸:} 也是后来没剧可看的时候，开始看得TV版，越看越来劲。900来集，我看了近两个月吧…其中还跳了几集…忘了为啥跳了，反正跳了，又能拿我怎样？ 名侦探柯南，好看，真好看，非常好看。如果觉得太长，完全可以从700集以后开始追，我觉得前面的剧情没有后面的剧情有意思。当然，前面剧情有它魅力所在，但我还是选择后面剧情，因为出来很多我喜欢的人物。 更可以看剧场版，第20部，非常好看，我觉得非常好看… 评语名侦探柯南至今更新了900多集，仍旧广受好评，除了忠实粉丝和热衷推理人士外，也可当作休闲必备之剧，集烧脑（假装一下，剧情短，刚烧就被尿灭了），悬疑，惊悚（多少年过去了，还在上小学，还不惊悚？），虐恋（你懂的）等为一体的N年长篇钜制…还是非常有意思的… 蜡笔小新，一个少儿不益的动漫…蜡笔小新，到我这个年纪（其实我还是个boy），被别人看到自己在看蜡笔小新，可能会被误解，多大人了（其实我还是个boy）还看这种幼稚的动画片儿。 而我只想说，QNMLGB…(#)$)(()@()#*@()#，谁要敢说是小孩儿看的幼稚动画片，你就让他看几集自行分辨一下… 全剧充斥着少儿不益气息，简直不能再老少皆益…{:馋嘴:} 而真相是，其实没我说得那么夸张，整部剧满满正能量，围绕幼稚园儿童小新（并不特别全是）展开的故事。可以算是日常动漫。 蜡笔小新，童年记忆。胆大，心细，脸皮厚概括了小新的人物性格特征（呃，也许吧！{:思考:}），我喜欢小新一家，特别是广志，除了席林，蜜琪，还有四眼（记不清叫什么了，就是上图右下，正南妮妮上面那人，对警察叔叔就是他…）这几个好吃懒坐，厚脸皮蹭吃蹭喝的家伙…{:怒骂:} 虽说都是新之助一家的日常，却很有新意，看着不累，很搞笑，非常的放松心情。之所以特别喜欢广志，是因为觉得广志这种上班族和我很像的缘故（虽然他有万年不变的32年房贷，但无形中都透露着土豪般的气息）。 蜡笔小新目前大概得有1500多集了吧，我快看完了，只差第一部，因为最近忙着追电视剧，就落下了。前段时间工作之余必看的动漫。还是非常有意思的。 剧场版虽说不是全部都看，但大多我是看过的。还别说，都挺有意思（本长文有意思会出现N多次）。 蜡笔小新里除了日常外，还有番外，如剑道，高中新之助，都市怪谈和一些主线外的剧情等等。 其中，都市怪谈看着差点吓尿（夸张出新高度，只是日常换裤子，吓尿多尴尬），也不算太吓人，只是很有氛围感，难免神经会小小的紧张一下，特别是风间回家上电梯那集（可以搜搜看，推荐）。 胯下痛公寓那一段（就是野原家爆炸后的临时居所），最后新家重建后的那温馨画面，真是惹人泪目。真是部有欢笑，有感动的好片。 色出一片天惊喜不断的野原一家和一只容易被遗忘却异常励志聪明爱家的神犬小白，高冷装清高的风间，暴力热心肠又善妒的妮妮，胆小爱哭的正南，热心爱八卦的大嘴巴隔壁大婶，万年单身却又渴望爱情的松阪老师，样貌酷似组织老大却格外温柔的老大园长，以及等等等等。 评语日常片，以上这些就是整部剧的全部及灵魂所在，一部可放松心情，释放压力的泡面番，非常值得一看… 寄生兽，有点重口味的热血番剧寄生兽是我看过最重口的番剧了（当然，这可能对很多番剧或重口味的人来说只是毛毛雨），至少对我来说，一开始我是拒绝的。 恐怖一般，较血腥和重口，动不动头就一分为好几段，然后变成武器或啥。一开始差点没看下去，后来越看越来劲，觉得这个画风似乎也变得可以接受，又觉得挺喜欢…没错，就是这么神奇…{:思考:} 整部剧就围绕主角和寄生兽来展开故事情节，上图为寄生在主角右手的寄生兽（名为小右）。寄生兽为寄生于人类，并吃食脑部最终控制人类为生存（可能是，忘了）。是部热血番，回来还被翻拍成真人版电影。 女主不论动漫还是真人里的都挺不错，主角就略怂了。不过经历这一档子故事换谁都可能会怂。主角新一，日语发音经常听成洗衣机是名大学生，某天未知情况下被寄生兽准备吃掉脑子之时却意外吃了右手，并错寄生于主角右手上，导致行动失败之能控制于右手。就此，一系列故事展开。 这部番剧，说实在虽然不长，但却看得挺有意思。期间听人介绍东京食种，看了两集，还是觉得寄生兽更有意思些，剧情更紧凑丰满些。 对于这种番剧，我想也只有小日本儿能够弄得出来，国漫虽然也有，但是上不了电视等视频站的。 寄生兽在我一开始看得时候，在寄生兽变身的那一刹那多少有些震撼，那变身效果相比美少女战士（人家才没看过呢，讨厌{:捂脸:}）那是有很大区别的，一个是可在某种程度上清空肠胃，一个是需要证明双手打字的（遮挡很好，得多骚才能不用双手打字呢？{:思考:}）。 这里就不放图了，和谐为主。 评语值得一看，其中有一段回忆一下，略带丝丝甜意…我也不知道在说啥。总之，闲着无聊可以看一下，我觉得还行… 海贼王，带着梦想启航海贼王，不得不说，很经典，放在最后（啊，该是最后了，我觉得挺长的了，我就看过这么几部）是因为我觉得是我看过的动漫里最好看的… 虽然说，海贼王最经典最好看，但也只是说说，我其实到现在也只是看到他们打完多弗朗明戈而已。后面的我还没开始追，漫画也没看，剧场版就看过一两部（我看我就这样结束吧，多少有些尴尬）。 其实我觉得，海贼和火影两个没啥可比较的，不同故事，不同冒险。啥都不同，相同的就都是羁绊，热血，动漫，都很多集这些而已。而我喜欢多于火影的原因是，我更喜欢海贼的画风。 本以为回忆不多，实际，的确很多，有的回忆还行，有的回忆看着有点睡觉。虽然过往或多或少有点重要，但总感觉太能啰嗦了，看多了就觉得厌烦了… 还有就是不得不吐槽每次大战后都要来个类似番外的小剧情，真的很讨厌，我曾去网上查了，说这是TV自制。果然，自制的永远都是掉粉最多的。 其中新世界前也称前半段，感动人的地方有很多，香克斯为救路飞被海王兽咬断胳膊（后来觉得略牵强），收乔巴时的感动，冰天雪地路飞背着同伴爬雪山被冻伤的感动，烧梅丽号的感动以及对于艾斯的感动等等很多。 新世界之后感动就少了，可能是我看得少了，或是剧情没到。看海贼王也是因一时兴起，所以就看了。然后就是连天加夜的，毫无尿点，除了TV自制有点恶心外，但一集没跳过。 路飞在自己成年时带着梦想仅一个木桶就出海了，目标明确，找十个同伴，找到罗杰的宝藏。 其实过了这么久，宝藏明显次要了，同伴间的羁绊以及航海的这段经历就比万千宝藏来的都珍贵了。 当初看得差点自己就出海了（当然，这是笑话，我刚笑的肚子都疼了）。海贼王里的人物最讨厌的就是赤犬和黑胡子，一个杀了艾斯，一个杀了白胡子。其它就没啦，小人物不提也罢。 当初，鹰眼一剑（刀）把海盗船砍沉真是绝对震撼（那时三大主力还是个菜鸟，毫无强大战斗力可言），我都热血沸腾了，可能我比较喜欢那种较为YY的场面。到后来的大家都变得强大，越来越精彩。 不仅热血外，还有搞笑，活宝路飞，段子手乌索普，色色的厨子香吉士，路痴海澡头索隆。看着轻松，不压抑。 除此之外，我最感兴趣的就是恶魔果实能力，像除了路飞这个天敌外近乎无敌的自然系能力者，艾尼路，暗黑果实可吸食能力的果实拥有者黑胡子（已吸收白胡子震震果实，想想都恐怖），还有很多，不一一列举了。还有一个是动物系能力果实外的体术组织，CP9。里面的人都好有个性的感觉。 目前出现的CP0不知道啥能力，不过看着也不错。 不过，我还是更喜欢CP9多一点，里面的长颈鹿和老大路奇，很帅，很个性，这两点和我有点像…{:捂脸:} 以后有时间再追吧，先养肥再看… 评语故事精彩，可以试着看两集，反正又不会怀孕…","categories":[{"name":"动漫","slug":"动漫","permalink":"https://www.iloveyz.com/categories/动漫/"}],"tags":[{"name":"动漫","slug":"动漫","permalink":"https://www.iloveyz.com/tags/动漫/"}]},{"title":"赤色娱乐的诞生，完整版...","slug":"about-red-entertainment-once","date":"2017-12-16T03:33:15.000Z","updated":"2018-11-10T16:15:56.444Z","comments":true,"path":"56195/","link":"","permalink":"https://www.iloveyz.com/56195/","excerpt":"有个前言好像很厉害的样子此篇乃全站最能啰嗦文，主要用来记录我的建站经历。其实以前写过，但好像只是说了我的个人经历，所以，此次只说自己建过的站…","text":"有个前言好像很厉害的样子此篇乃全站最能啰嗦文，主要用来记录我的建站经历。其实以前写过，但好像只是说了我的个人经历，所以，此次只说自己建过的站… 准备换个博客环境，和老弟一起记录日常…2017-08-18 21:58:50申请hexo其实没几天，日夜折腾，虽然没折腾出什么来，但也图一开心，挺有成就感，也特别的有意思。建站之初就是想自己在网络上得有个自己的… 赤色娱乐是我自己瞎想的名字，随后又有了赤色实验室，赤色研究院，赤色动漫，总之一切有关赤色的东西。赤为红，亦可译为红色娱乐，都行。 虽然名字是红，但网站和红并无半毛钱关系，纯粹只是一个名字而已。不过曾想过使用红色为主导色，但对红色没有太大感觉，就作罢了。 赤这个字，是我某天的突发奇想，第一自认的感觉就是挺酷的。这字上档次。然后就使用了，于是怀着娱乐的精神就整合了娱乐，赤色娱乐就这么随性的出现了。 赤色娱乐，对于我来说是有感情的，使用多年，已经习惯这个名字。只要涉及网站必然会有赤色二字。 赤色娱乐前身赤色娱乐的前身，其实名字叫作小小萤火虫，我喜欢软件工具资源分享，于是，网站就这样建立起来了，小小萤火虫，没啥特别含义，某种意义上更像是昵称，不过想想，倒也挺不错的。 集可爱，俏皮，随性于一身，关键名字还挺好听。 小小萤火虫是我真正意义上的开通自己的第一个博客，以前也有过下载站和博客。但都是小打小闹，没两天就关闭或不再更新了…而且小小萤火虫我使用的是wordpress的第一个站点，非常有成就感。也是我自己设计的网站风格。 那个时候对于IE的BUG一直仍然处于一愁莫展的状态，技术那是相当的有限啊。主题也是折腾了N久。所以那个博客是我花费心思制作的。 那个时候对javascript完全不懂，对于下来菜单这种网页特效简直着迷。看到别人网站的特效，自己不会，那纠结的心理也是相当着急的。现在想起记忆犹新。 之后就记不起来，是何时从小小萤火虫改名为赤色娱乐的了。好像是域名到期后的再次建站？忘了，但小小萤火虫之后就是赤色娱乐。 赤色娱乐使用过的域名使用过很多域名，都是自己到期忘记续费，导致域名被抢注，丢了域名，真是相当痛恨，那些米虫。也只能怪自己。 不过相对来说，对于我这种域名选择较困难的人来说，有个自己心仪的域名还是非常难得的一件事情。 我估算了一下，我总共用过以下几个域名… 域名1: www.zxzhang.com 这个域名使用时间最长，以前所有做过的站都是这个域名，当然在此之前也有些其它域名，都是1元注册的cn域名，弄着玩的，现在就只说赤色娱乐用过的域名… 此域名，历经小小萤火虫，小小电影院，什么什么下载（记不清了，是使用新云系统弄的下载站），然后就是赤色娱乐… 域名2: www.viecha.com 这个域名，毫无含义，是我使用过的邮箱帐号，后来实在找不到好域名了，索性就把自己帐号当作域名来使用，还是有些感情的。 记得域名被抢注后，来我站访问的人给我留言说，还是觉得这个域名好，都记住了，是直接输入域名访问的，当时就眼泪一把鼻涕一把的。相当感动… 此域名只用于赤色娱乐… 域名3: www.refory.com 此域名灵感来源同上，此域名，用于赤色娱乐旗下网站，如赤色娱乐，赤色研究院，赤色实验室等赤色相关网站… 域名4: www.zxzszv.com 主要用来和老弟一起建站时使用，那时主要用于兴趣网站的建立。那时对漫画着迷，就建立用来练习漫画及漫画相关的博客… 域名5: www.xiaour.com xiaour，xiao u r，u在英文简写中是you，r是are，其实当初的想法是指小小的我们，但后来自己也不知道为啥弄了一这名。不过这个域名是我喜欢的域名，看着很舒适。域名对于我来说，只要满足好看，好记，就可以了，当然也是因为这两点，让我对域名的选择变得异常困难。不只是现在域名难注，好域名都被抢注有的卖钱，有的是在用的。所以剩下的自己又找不到喜欢的。就变的不好找了… 此域名只用于赤色娱乐网站… 除此之外，我只用过.com和.cn，以及免费的.tk域名，其余就没用过了。也不全是，以前使用过.cc是别人赠送的。不过以上几个域名都和赤色娱乐有关，所以其它域名就没有说的必要了… 总结一下，感叹一下…其实做网站到现在，热情仍旧，可能中途或多或少与精力时间有关，出现了断更，或遗忘。不然一直把一个网站做到现在，也许已经是个大家能够生活闲余的消遣之地也说不定。嘿嘿！~ 本着娱乐为主做一个综合类的网站，的确需要很多精力去维护，因为做站的根本就是需要时间去沉淀和积累的。 这个hexo我准备单机的进行下去。记记日常笔记，杂乱，工作，影视，视频。我觉得足够。记录和总结也种学习… 以前对建站，主攻内容，经过时间的推动，现在尽是折腾了，- -。不过同样乐在其中与愉悦地写博客相比。我觉得同为建站的初衷。没有任何不同。","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"赤色娱乐","slug":"赤色娱乐","permalink":"https://www.iloveyz.com/tags/赤色娱乐/"},{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"}]},{"title":"再折腾就剁手...","slug":"finish-make-about-hexo-theme","date":"2017-12-15T13:33:45.000Z","updated":"2017-12-26T08:25:47.225Z","comments":true,"path":"10032/","link":"","permalink":"https://www.iloveyz.com/10032/","excerpt":"其实也不知道说多少遍了，再折腾就剁手。这次绝对是真的，- -。不忘开博初衷，不然就没太多记录的乐趣了。所以就此决定，不再继续折腾。","text":"其实也不知道说多少遍了，再折腾就剁手。这次绝对是真的，- -。不忘开博初衷，不然就没太多记录的乐趣了。所以就此决定，不再继续折腾。 最近一直在整长文章页面，倒也遇到不少麻烦，但都解决了，非常的有成就感。可能还存在不少问题，懒得解决了，除非是大问题，不然肯定不再折腾了。嘿嘿。hexo用了近5个月左右吧，感觉挺有意思的。除了不能随时随地的更新文章，其它都挺好，不过和bitcron相比，bitcron还是集聚魅力的。bitcron的文档详尽，比hexo不知道清晰多少倍。估计使用bitcron制作长文章页面，肯定效率会快很多。如果以后我用回bitcron，估计不会折腾长文章了，耗时耗精力。{:睡:} 长文章页面...再一次折腾...2017-12-12 10:05:01 长文章折腾 长文章，就是指很长的文章，分块来展示文章，其实弄长文章的想法很早就有了，以前在用wordpress的时候就已经开始了，而且... 最近天气忽然转凉，早上完全起不来，被转入新公司，才录上指纹，今天就迟到了二十分钟，{:挖鼻:}，同事还善意提醒让我来早点，差点儿没钻地下去。以前就老干这样的事，去单位就职，第一天就迟到，天天缺觉，不睡到快迟到都起不来。 这种毛病其实在小时候就形成了，根深蒂固。记得少时上学，第二天起床，闹钟响了墨迹半天起床，然后顺着楼梯一层一层的坐下去，这种操作还是挺骚的，迟到自然是常有的事了。以前天除了上班上学，休息日的上午基本不属于我，一觉睡到自然醒。这感觉还是舒坦的（当然除了上网需要早起外，这个很积极）。所以再好听的闹钟铃声都是异常刺耳的。 今晚就需要开始把闹钟调成固定的上班时间，想想就觉得有些恐怖…{:怒骂:} 这两天睡得都很晚，准备今天早点上床休息，开始追《军师联盟》和《我的体育老师》，后者已经完结了，有时间得把这剧看了，军师联盟几天没看是好事，省去了追剧的烦恼。 我的豆瓣里想看的几部悬疑电影似乎也想看好久了。先放着吧，迟早把你看掉。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"长文章页面...再一次折腾...","slug":"long-article-style-design-page","date":"2017-12-12T02:05:01.000Z","updated":"2017-12-15T13:28:17.958Z","comments":true,"path":"25955/","link":"","permalink":"https://www.iloveyz.com/25955/","excerpt":"长文章折腾长文章，就是指很长的文章，分块来展示文章，其实弄长文章的想法很早就有了，以前在用wordpress的时候就已经开始了，而且也实现了类似小说的那种，有卷有章节，以前可切换背景色和查看当前文章内容封面之类的功能。","text":"长文章折腾长文章，就是指很长的文章，分块来展示文章，其实弄长文章的想法很早就有了，以前在用wordpress的时候就已经开始了，而且也实现了类似小说的那种，有卷有章节，以前可切换背景色和查看当前文章内容封面之类的功能。 这次折腾主要还是想以博客的方式来弄成长文章页面，没有太多没必要的东西，简单的功能就好。其实这样算起来也没怎么折腾太多东西。 hexo的自建标签很好用，可以自定义来做很多东西，这次主要的内容还是以自定义标签来完成的，而每个自定义标签就代表着一段文章。以前在折腾站内链接的时候就使用了这种标签。一用就完全停不下来阿，哈哈。 站内链接使用的是自带的{% post_link slug [title] %}，这次使用全新的自定义标签。 文章内链的研究…2017-12-08 11:21:35经过几天年努力，算是把文章内链搞定了，其过程，听者流泪闻者伤心，因为完全不懂nodejs所以寸步难行。这折腾的过程，我也是醉的不行不行… 也是折腾了两天时间才把文章页弄出来，关键是不知道hexo如何判断是否手机访问。不然可能会事半功倍些。不然只好硬着头皮把手机和电脑的样式相整合。真是件相当麻烦的事，不仅巨多样式，而且还容易搞错。 长文章页面，整体总局是我模仿好奇心日报长文章这个分类弄的。基本上就是照着做的，这种长文章的展示方式是我非常喜欢的。嘿嘿！~{:坏笑:} 虽然现在还有些小瑕疵，不过基本上是可以用了。非常的有意思。 最后次折腾，后续就是把小地方完善。 长文章具体内容相关长文章手机里的切换其实是使用swiper，这是个支持手机响应式幻灯插件，功能非常强大，而且非常好用。可控性优秀。 每段的切换和手机长文章首页的切换是同步的，这完全出于swiper强大的可控操作，双切换，能省N多事。一开始还为这事想了半天实现方法，还是准备工作做的太少。{:黑线:} 一开始遇到的问题是获取长文章每段的标题，主要这用于电脑上长文章的切换，后来才想到hexo自带就有toc，且一个toc即可搞定。 12345&lt;% if (!index &amp;&amp; post.toc)&#123; %&gt; &lt;div id=&quot;toc&quot; class=&quot;toc-article&quot;&gt; &lt;%- toc(post.content) %&gt; &lt;/div&gt;&lt;% &#125; %&gt; 瑕疵代码块需要使用hexo的代码块标签，不然就任性的显示undefined，而且因为使用了swiper的原因，会出现如果代码横向太宽，无法在手机进行滚动。这个问题不准备折腾，太烦躁了。 还是不错的，哈哈。之后就是电脑上左侧固定滚动的问题，一开始研究着随屏滚动，实现好了，之后就是刷新后左侧的侧边栏在你不滚动滚动条时会消失（其实是跑到上顶端了），以前也没想着弄那么多，就没管，这次进行了相关的解决。让网页刷新完毕，侧边栏在根据位置自行回归。 长文章在首页的样式与其它首页的样式根据判断而来，一开始想法不对，弄的出现两篇一样的文章，后来才知道是自己太蠢了。 其实按这个方法，视频页也是可以整出在首页显示不同的样式，不过，视频页并没有打算继续折腾。所以长文章已经是收官（折腾）的最后一功能。除非以后自己想到更好的点子。 hexo折腾了很久，其实除了模板和一些小功能，想想也并没有太多东西，自己的能力有限，所以对于折腾实在是有力无心。不过过程是开心的，也学到不少东西。跟之前预定好的一样，这次用了不是特别多的js代码来控制。基本上都是拿些现成的东西，还是很不错的。 至少现在自己看起来很舒爽。哈哈，自己用这个hexo写东西其实简单的博客就行，折腾纯属是自己的瞎弄。不过倒也学到不少东西。对hexo有了一些了解。倒也不是件坏事。 就像我之前说的，折腾的乐趣有时会大于写博客的乐趣。而不折腾的时候写博客似乎又少了些什么…{:嘻嘻:}，这种自虐的心理，我想很多人应该和我一样吧。嘿嘿！~ 在每次折腾时，总得去google，百度一堆的东西，上各大网站提问，像什么segmentfault，v2ex等。从中学到了很多新东西。虽然过程稍微艰辛了些… 长文章问题的相关总结 左侧的侧边栏，里面还有个小功能没有实现，就是滚动条随着页面的滚动而滚动。不然会找不到当前锚点的链接所在位置。 该问题已经被成功解决，真是花了很久的时间，各大网站都去问了，segmentfault上有人回答我，但最终不是我想要的效果，但代码写的很好，准备以后用作其它方面。于是，为了自己想要的效果，我只好自己找着方法去解决了，最终解决了该问题。 问题难点所在。就是一开始的思路不正确，思路上老想着应该按页面滚动条的位置进行计算，可最后经过证明，此方法并不是多靠谱，因为此方法会导致计算的不够精准以及锚点来回抖动的问题。所以我采取了计算当前位置也就是class.cur（锚点所在位置），然后计算之前的高度进行叠加。 开始努力工作，努力学习折腾结束，意味着新工作的展开，为此，就需要新的学习，毕竟学习才是成长的唯一途径。 这里预留部分，主要用来显示五个。目录最多显示五个嘿嘿，其实长文章基本已经完成了，只不过现在就差一个最烦躁的小功能，是为了方便使用，这个功能搞了两天，真是有够折腾的，- -，这次是冲动。这个弄完，绝对不折腾了，太要命了。 基本上已经算是收尾了，当然除了我之前说的，这之后，我会把这篇文章重新编辑，弄成真正意义上的长文章（就是每段都有很多字这样。）长文章还是不错的，嘿嘿。 吐槽hexo似乎没有判断是否为手机访问的函数。- -，真是很要命啊。不然应该会很快完成吧。我猜。。。{:扶眼镜:}","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"折腾","slug":"折腾","permalink":"https://www.iloveyz.com/tags/折腾/"}]},{"title":"一不注意，差点又折腾了...","slug":"about-hexo-edit-study","date":"2017-12-11T09:00:00.000Z","updated":"2017-12-12T02:00:58.691Z","comments":true,"path":"10571/","link":"","permalink":"https://www.iloveyz.com/10571/","excerpt":"昨晚看到F12有个错误提示，看了一下，是因为gitalk未登陆导致的授权问题，又想到必须先登陆而且指定是github之后才可以登录，这立马就有些不爽了，- -。于是想到了前些天看到的staticman基本满足我的需求。正好也是支持github page的评论。","text":"昨晚看到F12有个错误提示，看了一下，是因为gitalk未登陆导致的授权问题，又想到必须先登陆而且指定是github之后才可以登录，这立马就有些不爽了，- -。于是想到了前些天看到的staticman基本满足我的需求。正好也是支持github page的评论。 staticman就算不是github用户也可以轻松留言，大致就像wordpress那种留言方式，昵称，邮箱，网址，填写这些信息，就可以留言。还是深得我心的，不过后来想想，不仅折腾麻烦，而且后续功能整理起来又很烦。还是算了，本身对英文就看着头疼。毕竟不想搞得太麻烦，都说了不折腾了。 今天上午也不知道怎么想的，就一心想着弄个相关文章，倒是弄出来了（其实并没有做完，我的想法是，有着相关性的就关联，如果文章一个相关的tag都没有，就随机显示）后来觉得一时没想好放哪决定不需要了，还是上面说的，不再折腾。 其实这个hexo博客，也仅仅只是放在网上自己的一个小地方而已，没事记记东西。时间精力有限，倒也没想着把网站发扬光大。纯一单机就挺好，我觉得。嘿嘿！~{:扶眼镜:} 现在博客基本不差什么，至少满足了自己的需求。其实按道理来说，评论是不需要的，单机要什么自行车。 刚一开始才接触hexo就没日夜的整，还真是疯狂啊。主要是心血来潮想整的视频页，弄了好久，因为视频页是我在wordpress上的突发其想，纯粹满足自己的看视频的喜好。也没啥技术可言。 视频页展示，主要用来展示，暂时没想到其它好的作用，观赏下社会青年魅力也不错！~2017-08-11 08:54:48 这篇主要是用来提供观赏使用，视频页...还有一重要的事情 而网站的样式呢，完全没时间和精力去构思和设计，就随便按照最简单的来。有些地方都是模仿别的站弄来的，哈哈。{: 坏笑 :}，这叫能省事就省事，属于拼凑型网站风格。自己看得过去就行。 总得来说就是懒，一折腾起来不折腾的时候就感觉少了什么，不知道是受惯了这种折腾的感觉还是就是为了折腾才弄的博客就不得而知了，明明折腾的初衷就是为了更好的体验博客和写作的乐趣。 吐槽一下hexo官方的文档写的好模糊。想搜的什么也搜不到，介绍的也不是特别清楚，对于像我这种本来就水平有限的初学者来说，太难了，最关键的是，百度，GOOGLE，你想去搜个hexo什么东西，相关文章又少的可怜，当然大多是搜不到的。一般都是什么如何配置建站hexo+github静态博客的配置…只好默默地看node_modules里的文件，慢慢找。真是太费劲了。- -。希望hexo能够补充的更丰富些… 我也是最近才知道hexo.extend.helper.register是写在主题scripts文件下.js里的。诱惑不了我折腾，放弃吧… 昨天弄太晚了，略困，现在看屏幕都有些刺眼了，- -。晚上准备不看电脑了，泡杯茶修身养性去了。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"折腾","slug":"折腾","permalink":"https://www.iloveyz.com/tags/折腾/"}]},{"title":"卡通爱好者，整理相册发现一些以前制作的卡通人物","slug":"old-design-topic-blog-article","date":"2017-12-09T13:55:01.000Z","updated":"2017-12-09T14:46:39.697Z","comments":true,"path":"6286/","link":"","permalink":"https://www.iloveyz.com/6286/","excerpt":"今天闲来无事，去翻以前使用过的相册，发现里面还存放着我建博客时心血来潮做的卡通人物，感觉很亲切。我个人还是很满意的一些，嘿嘿！~","text":"今天闲来无事，去翻以前使用过的相册，发现里面还存放着我建博客时心血来潮做的卡通人物，感觉很亲切。我个人还是很满意的一些，嘿嘿！~ 我是个比较喜欢制作一些卡通人物，像人物，兔子。其实我也不知道什么时候喜欢的，就是感觉对这方面感兴趣。不过自己没有绘画技术也只能是瞎琢磨，所以纯属自娱自乐。 提示一大波兔子来袭… 吐槽因为没有美术功底，所以对背景和动作完全没有概念，只能瞎凑合或是简单那一部分。{:扶眼镜:}（图内链接和文字请忽略…） 提示一大波人物来袭… 额，哆啦A梦是我模仿出来的，纯粹是用来凑数的。嘿嘿！~{:嘘:} 其实人物的还有好多，但我找不到了，不知道扔哪儿了。不过也罢，都是些自娱自乐的作品。难登大雅之堂。其中这些，兔子其实是我最满意的，当初画兔子的时候就想着画个属于自己网站的什么东西。研究了N久，最后就决定是兔子。{:鼓掌:} 以后准备重制一版，因为我没原文件了，所谓重制其实就是照着再画一次。 人物方面，以前喜欢两头身，后来觉得麻烦，就改成方方正正的，有点MC方格。制作起来省事，也方便修改。说起人物，记得以前为了画发型，我都是去QQ秀官网照着里面的发型做的。还是现在的比较省事，圆圆圈圈就搞定了。{:扶眼镜:} 现在没啥时间搞这些，主要想画几个比例正常些的人物，用来制作一些特定场景还是蛮实用的。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"赤色娱乐","slug":"赤色娱乐","permalink":"https://www.iloveyz.com/tags/赤色娱乐/"},{"name":"设计","slug":"设计","permalink":"https://www.iloveyz.com/tags/设计/"},{"name":"卡通","slug":"卡通","permalink":"https://www.iloveyz.com/tags/卡通/"},{"name":"人物","slug":"人物","permalink":"https://www.iloveyz.com/tags/人物/"},{"name":"人设","slug":"人设","permalink":"https://www.iloveyz.com/tags/人设/"}]},{"title":"无题也是种很好的标题...","slug":"blog-article-untitled-1","date":"2017-12-09T02:55:15.000Z","updated":"2017-12-25T13:27:11.449Z","comments":true,"path":"51677/","link":"","permalink":"https://www.iloveyz.com/51677/","excerpt":"最近晚上都会看电视剧，什么《猎场》，《我的！体育老师》。还有最近才出的《军师联盟虎啸龙吟》。挺有意思的，至少很打发时间，睡前的催眠必备。嘿嘿！~","text":"最近晚上都会看电视剧，什么《猎场》，《我的！体育老师》。还有最近才出的《军师联盟虎啸龙吟》。挺有意思的，至少很打发时间，睡前的催眠必备。嘿嘿！~ 猎场喜欢猎场这种职场竞争，商战的电视剧，而猎场诠释的很到位。看得很过瘾，虽然情感戏，让人看得有些郁闷，但也算是描述了主人公在情感道路上的挫折。从刚开始去工厂和店铺开业的演讲，提高员工工作激情和鼓动顾客消费以及情感方面等铺垫，经人介绍走向传销之路，之后进了监狱，演员演技是在线的。 之后就是主角在监狱受再教育，经过人生导师刘量体的塑造，使自己的技能又上升一个层次，然而出狱后，却失了心智耍起了小聪明，利用一假身份进行各种造假去了一家大公司。结果是悲惨的，不仅失去了工作，身份，更上了黑名单。这无疑是一次重大打击以及使自己又留下了一个人生污点。 经过朋友的劝说，自己以飞镖随机定位法，将自己以后重新开始的地点从北京转移到了杭州。至此，猎场正式拉开帷幕。 不过，猎场正部剧都挺好，最后几集有点莫名的感觉偏离猎场（具体请自行观看此剧）。让我瞬间对猎场没了兴趣，55，56集都是跳着看，57也就是昨晚这集，压根提不起兴趣了，感觉有点恶心了。感觉猎场52集结束正好。多出来这几集，就是毁整部剧的… 我的！体育老师我的！体育老师，讲述由张嘉译主演的体育老师与一位小自己20岁的宠物店女孩儿的爱情故事。整部剧集还是很轻松的，看着也不累，而且有张嘉译的就是好片。没事看看还是不错的。嘿嘿！~之前也说过这部剧。 没事看看电视剧也挺不错...2017-11-27 20:35:52 晚上熬夜似乎已经成了习惯，半夜上床，睡着的时候基本上都是手机砸脸，想想也挺刺激的。哈哈，以前的时候大多数时候都去刷B站，现在就盯着优酷... 军师联盟虎啸龙吟军师联盟虎啸龙吟，是军师联盟的下半部，上半部是个很好看的电视剧，值得一追，最近已经可以看了，还是不错的，我还没正儿八经的开始看。因为每次看一半我就着了。- -。{:睡:} 其实主要是上床太晚了，困。下半部是颠峰对决，想想就精彩。我是个半三国迷。因为看三国都是一段一段的，但又很喜欢，就称作半吧。其实更贴切来形容那就是伪三国迷。我曾去过某贴吧，具体是哪个贴吧忘了，里面都是三国迷，不仅熟知三国且对三国相关的剧都有看。我也是很佩服的。不过我也迷了一阵，看新版三国。看了差不多一半左右，没看了，迅雷下载着看的。现在还时不时的提醒我，某部下载了的三国已经看了多少天，还未看完的提示。{:斜眼:} 想了下，好像很久都没看过电影了，现在也不知道有啥好看的，悬疑片儿，有的在B站看过五分钟看完整剧的视频后，就没啥兴趣继续看了。现在倒是对电视剧热衷起来也是醉醉的。 题外现在网上的快递真是厉害的不想说话。一个快递居然发货两天，毫无音讯（输入单号，连快递运输信息都没）。厉害了…","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"文章内链的研究...","slug":"article-post-link-in-website","date":"2017-12-08T03:21:35.000Z","updated":"2017-12-21T14:30:20.020Z","comments":true,"path":"50931/","link":"","permalink":"https://www.iloveyz.com/50931/","excerpt":"经过几天年努力，算是把文章内链搞定了，其过程，听者流泪闻者伤心，因为完全不懂nodejs所以寸步难行。这折腾的过程，我也是醉的不行不行的…","text":"经过几天年努力，算是把文章内链搞定了，其过程，听者流泪闻者伤心，因为完全不懂nodejs所以寸步难行。这折腾的过程，我也是醉的不行不行的… 对于文章内链的执念来自wordpress，因为可以很美观并可自定义的展示网站其它文章链接，就这点就足以吸引我去折腾。当然，点赞和文章浏览次数也是。那时为了点赞也是折腾了N长时间，其实在我完成点赞后，发现基本上就是把刷新变成了点击增加而已，最多就是cookie存下当前的状态。当然一开始的思路是正确的，然后不断调整。完成后，除了成就感，还是成就感。{:坏笑:} 而文章内链让我对nodejs又有了些认识，当然我所指的认识也只是了解了最最基本的一些东西。对nodejs不懂，很多都不知道该怎么进行。 一开始，尝试使用replace过滤文章的html标签，为此还想了很多办法去进行。结果一弄就报错。TypeError: Cannot read property &#39;parent&#39; of undefined以及ReferenceError: replace is not defined等。这也是我唯一可以看懂的地方了。 首先，在做之前开始构思，一开始的想法是在主题里进行对文章的循环来达到文章内链的目的，的确可以循环出所有文章链接，但却不知道该怎么对文章里的链接进行匹配。弄了一段时间，发现这个方法对于我来说，似乎并不是很好的可行方法。但我并没有因此而觉得无法实现，就去网上找相关文章，最后无果。经过一两天，没实现这个功能还是觉得很不爽，于是就继续在网上搜索，在google上偶然间发现了，可以使用标签{``% post_link slug [title] %``}我简单的试了下，在不输入[title]的情况下，可以直接获取文章的标题。 日常研究和like页面以及关于博客2017-11-25 10:21:46 bitcron试用到期了，暂时没打算续费，但以后估计还会用，主要还是没啥时间和太懒更新，先闲置着吧。现在把hexo拾掇拾掇继续用起来，... 这又重燃我的信心，开始寻找post_link这个文件，并尝试修改，在这个文件里发现到有一个post.title我就试着，post.content，结果还真输入了对应文章。无疑这是令人兴奋的。 于是折腾就此展开。一开始的难题就是，过滤html标签，限制文字字数。有难度，虽然hexo有自己的限制函数，可无法直接使用。苦恼，开始找原因，发现需要调用，var util = require(&#39;hexo-util&#39;);于是调用，再使用对应的函数，立即解决问题。于是如法炮制，因为时间post.date获取后是unix时间戳（单位毫秒），于是使用moment.js（hexo同样已经集成var moment = require(&#39;moment&#39;);）把时间成功转换。 最后成功了，样式调整好，成就感溢于言表，最后觉得太单调，又无图无真相，就开始研究如何获取文章内第一张图的src。因为无法直接使用replace和match就很难正则匹配，弄了半天也弄不出个所以然。 于是经过一些尝试以及去网上询问，才知道cherrio，看到这个等于发现了新大陆，而hexo是集成了cherrio的，可以在nodejs里使用简单的jquery。这让我很兴奋啊。于是最终完成了文章内图片的获取和判断。 过程是困难的，结果是令人满意的。经过努力已经把hexo clean之后出错或获取不到文章内容的问题解决啦，目前近乎完美。也不想多折腾了，感觉不错。嘿嘿！~{:扶眼镜:}，就此，hexo的折腾至此结束。不再折腾啦！~ 最后的折腾…并把以下东西整了下，这次真结束了，不再弄了，- -。要好好写博客了… 修复一些样式问题 删除分类链接，移除分类页面（懒得折腾） 同时删除标签页，归档页 删除搜索里的上述链接 代码框的样式问题 手机站内链接的多行样式","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"文章","slug":"文章","permalink":"https://www.iloveyz.com/tags/文章/"},{"name":"内链","slug":"内链","permalink":"https://www.iloveyz.com/tags/内链/"}]},{"title":"又一周","slug":"life-work-change-hexo-link","date":"2017-12-06T14:28:50.000Z","updated":"2017-12-26T08:25:56.287Z","comments":true,"path":"23126/","link":"","permalink":"https://www.iloveyz.com/23126/","excerpt":"又是无聊的一周，看标题，可以发现这又是一篇有关生活的文章，我发现不知不觉竟变成一个喜欢记琐事的人。我也挺醉的，不过时常的记录和总结也许也是好的…","text":"又是无聊的一周，看标题，可以发现这又是一篇有关生活的文章，我发现不知不觉竟变成一个喜欢记琐事的人。我也挺醉的，不过时常的记录和总结也许也是好的… 天气渐凉，不知是疲倦还是自己把所谓的激情磨平，总之一切都不在有趣，开始有点厌烦这种一层不变，碌碌无为，但却毫无燥起来的冲动和激情。一切似乎变得麻烦。总是在不知不觉中给自己找着借口和推辞。 这样的生活无趣且乏味，2017快接近尾声，不得不承认，这一年，似乎又是平淡且一层不变。什么都没做，和以前也没有任何不同。更别提什么飞跃的成长。 然而，我却迷茫了，没毕业前，就想找个自己感兴趣的工作，的确完成了，但真正工作中却觉得和自己想的有出入。 工作了，时间一长，又觉得毫无挑战性，而在这些进行中的时候，似乎最初的理想已经不复存在，很多时候，我总是在努力回想自己的理想到底是什么。而答案总是一片空白。 这样的一层不变太没意思了，说安逸并不是很安逸，说享受生活，却总在忙碌的工作中。 得改变，至少得改变现状，得有提升，至少比现在要好。需要好好的规划下接下来能做的事情了。实在有点不喜欢现在的状态。 努力努力再努力… 题外文章内链接有难度，一开始是我想简单了，利用在文章页循环似乎并不可取。首先，我没有好方法获取文章内所指定的链接，比如在文章某处的[](文章ID)，官方倒是给出了个方法。那就是在文章渲染后开始对文章里的链接进行正则的替换，不过不知道需不需要进行循环，具体代码完全不熟，真是寸步难行啊。其次，我使用了官方给出的标签，一开始以为有戏，却也被代码给我弄蒙了，具体代码是使用这个可以在不填写[title]的时候显示你所调取的文章标题，于是我去找了该文件，return处加了一句post.content，是可行的。 不仅输出了调用的文章标题，内容也有了，但是是全内容，无法使用CSS控制成我想要的样子。 所以使用标签是可行的，而且也挺方便调用的，接下来的问题，我需要弄清hexo的代码，不然还真是不知道该怎么整了。看可不可以只显示&lt;!--more--&gt;之前的部分，并把html的标签及图片全去掉，然后再提取文章的第一张图片，如果没有就不显示， 这是我接下来要做的，准备近期好好研究一下。 先不扯啦，睡觉…","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"}]},{"title":"无趣，无题，心情文，嘿嘿...","slug":"work-so-tired-and-whatever","date":"2017-11-28T13:45:50.000Z","updated":"2017-12-26T08:26:17.289Z","comments":true,"path":"10376/","link":"","permalink":"https://www.iloveyz.com/10376/","excerpt":"加班很无趣，这两天脑袋处于高速运转状态，创意，结构，逻辑。现在想得全是这些，回到家得静下心来做整理，这两天还是蛮累的。并不是肉体，还是精神上的累。","text":"加班很无趣，这两天脑袋处于高速运转状态，创意，结构，逻辑。现在想得全是这些，回到家得静下心来做整理，这两天还是蛮累的。并不是肉体，还是精神上的累。 所以这些天晚上回到家都不会搞很晚才上床休息，需要思维上的放松，不想再动脑子了，哈哈。{:嘻嘻:}其实工作上，有时候自己也的确太过于较真儿，很多时候明明可以省些功夫的，可偏偏非要自己去完成，这种工作的方法是不正确的。可能是不希望一层不变，谁知道呢。 其实总结下来，还是自己考虑欠缺，不周全，没有在一开始制订计划。总是埋头苦干，自己和自己较劲。以后得更正，有错误改了就是好同志。{:哈哈:} 培养事前自己该干和需要做的，捋出头绪，然后按着计划进行，如果与计划相左，需要及时更正，以免自己的手足无措。把自己懒惰的毛病改了，需要强迫自己做。不给自己找借口。- -。怎么这样一总结自己这么多臭毛病，算了，先改再说。 这两天努力完成工作，不然这种精神上的累指不定得多久才能结束呢。毕竟现在的努力可以为两天后争取最大的精神和思想上的放松。也可以算是动力。 明天一早去公司，我先把需要做的整理好，然后按照自己整理的进行思路总结和创新。希望能够起到些作用。先试试吧，我得学会工作。而不是因工作而被工作。 今天这篇杂乱文似乎略压抑，我也只是想简单的记录下工作状态和总结。为将来自己的未知目标做个铺垫。嘿嘿！~写作水平异常的差，估计我出奇的写作风格也只有我自己能看懂，基本上可以算是伴随着思想，想哪写哪，比较跳跃。 让我想起了以前上学的时候，老师讲台前拿着我们写作文的本子，口水横飞地指责，“这写得什么，流水帐都比这记得好！” 哈哈，扯了一堆，至少我觉得是有趣的，虽然文章看起来无趣。","categories":[{"name":"杂乱","slug":"杂乱","permalink":"https://www.iloveyz.com/categories/杂乱/"}],"tags":[{"name":"工作","slug":"工作","permalink":"https://www.iloveyz.com/tags/工作/"}]},{"title":"没事看看电视剧也挺不错...","slug":"episode-superstar","date":"2017-11-27T12:35:52.000Z","updated":"2017-12-26T08:25:59.878Z","comments":true,"path":"11044/","link":"","permalink":"https://www.iloveyz.com/11044/","excerpt":"晚上熬夜似乎已经成了习惯，半夜上床，睡着的时候基本上都是手机砸脸，想想也挺刺激的。哈哈，以前的时候大多数时候都去刷B站，现在就盯着优酷24点更新电视剧。- -，还真是有趣啊。嘿嘿！~","text":"晚上熬夜似乎已经成了习惯，半夜上床，睡着的时候基本上都是手机砸脸，想想也挺刺激的。哈哈，以前的时候大多数时候都去刷B站，现在就盯着优酷24点更新电视剧。- -，还真是有趣啊。嘿嘿！~ 最近被喜欢的演员张嘉译霸屏，这感觉还是不错的，从上半年的《白鹿原》，《卧底归来》到下半年的《急诊科医生》，《我的！体育老师》，《猎场》以及《生逢灿烂的日子》。{:扶眼镜:} 真是厉害，虽然《卧底归来》和《猎场》只是友情出演，但其表演功力还是非常值得肯定的，每部戏的角色都被演绎的很到位。使我这个小观众看得也是津津有味。嘿嘿，其实张嘉译的电视剧我看得并不多，起初我也只是看了他演的《营盘镇警事》就喜欢上了他，之后看了《你是我兄弟》。像什么《蜗居》，《一仆二主》貌似都不错，但我并没有看。以后准备补上。 最近在优酷追《猎场》和《我的！体育老师》，两个角色天差地别，两种不同风格，一个是稳重追求学术和事业的曲敏京，一个是一中学有点儿畏首畏尾的体育老师。抛开剧情不谈，张嘉译把角色诠释得很完美，至少在我看来。 嘿嘿，期待以后更多的影视作品。{:嘻嘻:} 说到《猎场》就不得不吐槽一下里面的感情线，占据了太多“猎”的剧情，几乎快要变成情场了，男女主的多次交集，都因一段段错误的插曲而错过。按照常规思路本以为郑秋冬感情受挫，情场失意，猎场得意。虽有些这样的势头，却无时无刻不充斥着感觉略多余的感情戏份，看得着实无趣了些。 经常是看着看着，我就睡着了，- -。我也是醉了，大概还有20多集，希望感情上的描述可以少些，不然真得改名变情场得了。 还是体育老师看着轻松些，至少没那么纠结，最多就是生活上的矛盾。多得还是较为喜剧氛围。 12月8日，军师联盟《虎啸龙吟》终于要开始播了，- -，等得菜都冬眠了，以前没怎么关注过吴秀波，没想到演得如此优秀，真是看得相当过瘾，- -。上半部基本上就是在说司马懿辅佐曹丕登基。下半部就是与诸葛亮的终极对决了。 期待中，哈哈…{:扶眼镜:}","categories":[{"name":"影视","slug":"影视","permalink":"https://www.iloveyz.com/categories/影视/"}],"tags":[{"name":"演员","slug":"演员","permalink":"https://www.iloveyz.com/tags/演员/"},{"name":"电视剧","slug":"电视剧","permalink":"https://www.iloveyz.com/tags/电视剧/"},{"name":"明星","slug":"明星","permalink":"https://www.iloveyz.com/tags/明星/"},{"name":"喜爱","slug":"喜爱","permalink":"https://www.iloveyz.com/tags/喜爱/"},{"name":"张嘉译","slug":"张嘉译","permalink":"https://www.iloveyz.com/tags/张嘉译/"}]},{"title":"like页面设计","slug":"like-page","date":"2017-11-25T14:36:25.000Z","updated":"2017-12-11T07:32:06.173Z","comments":true,"path":"35325/","link":"","permalink":"https://www.iloveyz.com/35325/","excerpt":"","text":"","categories":[{"name":"作品","slug":"作品","permalink":"https://www.iloveyz.com/categories/作品/"}],"tags":[]},{"title":"日常研究和like页面以及关于博客","slug":"blog-new-page-like-other","date":"2017-11-25T02:21:46.000Z","updated":"2017-12-26T08:26:01.773Z","comments":true,"path":"58255/","link":"","permalink":"https://www.iloveyz.com/58255/","excerpt":"bitcron试用到期了，暂时没打算续费，但以后估计还会用，主要还是没啥时间和太懒更新，先闲置着吧。现在把hexo拾掇拾掇继续用起来，嘿嘿。以前弄了半天不知道hexo语法，而hexo官方似乎介绍并没有多详细，可能还是自己的水平有限，一直不知道如何自定义…","text":"bitcron试用到期了，暂时没打算续费，但以后估计还会用，主要还是没啥时间和太懒更新，先闲置着吧。现在把hexo拾掇拾掇继续用起来，嘿嘿。以前弄了半天不知道hexo语法，而hexo官方似乎介绍并没有多详细，可能还是自己的水平有限，一直不知道如何自定义… 比如自定义文章的显示类型，我想到的唯一方法就是使用is_category(&#39;category&#39;)来判断是否是这个分类，然后使用不一样的显示方式。结果失败了。不管中英文都是false，一开始见到false以为有戏呢。{:挖鼻:} 本身对jsp就不熟悉，更别提java语句了，不过还是和javascript有相似的地方，倒也可以研究。 于是，我研究了一下写法，对category也就是分类进行循环，把所有的分类都循环出来。 1234567&lt;% site.categories.map(function(cate, index)&#123; %&gt; &lt;% if(cate.name == &apos;分类名称&apos;)&#123; %&gt; &lt;% cate.posts.sort(&apos;date&apos;, &apos;desc&apos;).map(function(post)&#123; %&gt; &lt;%- partial(&apos;common/like&apos;, &#123;post: post, index: true&#125;) %&gt; &lt;% &#125;) %&gt; &lt;% &#125; %&gt;&lt;% &#125;) %&gt; 的确是可行的，并且使用cate.name进行判断，如果等于这个分类就开始显示对应的模板文件。这个问题解决了，我也成功的制作了like页面，还是有点意思的。 既然可以以这种形式判断，那接下来我就要研究一下，bitcron的一个文章内链的功能。 思路bitcron根据站内文章并以超链接的形式放入文中，如[](文章固定链接)然后对文章内链接进行遍历，如果找到条件成立的就以上图显示方式显示。 如果文章内没有图片及文字仅一行 视频页展示，主要用来展示，暂时没想到其它好的作用，观赏下社会青年魅力也不错！~2017-08-11 08:54:48 这篇主要是用来提供观赏使用，视频页...还有一重要的事情 正常显示 没事看看电视剧也挺不错...2017-11-27 20:35:52 晚上熬夜似乎已经成了习惯，半夜上床，睡着的时候基本上都是手机砸脸，想想也挺刺激的。哈哈，以前的时候大多数时候都去刷B站，现在就盯着优酷... 文章内没有图片而是自定义的Front-matter图片的获取 hexo部分暂时折腾结束，回归工作...2017-08-15 08:52:48折腾结束喽，该收拾收拾把工作解决解决了，回头会记录一下，嘿嘿。折腾的还不错，虽然没有实现啥特别的功能，但也还算满意，所以就暂且这样吧。反正... 我觉得首先得在文章页把所有文章的链接循环出来，然后进行匹配。我也只是简单的这样琢磨了一下。hexo的文章页应该就是按这个思路进行的。 从bitcron转回hexo，也把点赞给弄回来了。与浏览量一样，通过leancloud进行存储来实现的点赞功能。倒没什么不妥的地方。因为不需要登陆，所以以cookie方式存储，倒也无所谓。 接下来只要把站内链接给搞定，就不折腾啦。嘿嘿。 最近工作需要突击一个项目，我的休息日也泡汤了。最烦加班，心里很不爽。但也很无奈，加就加吧，权当是学习了。{:挖鼻:} 闲着无聊，把LOGO改了下，虽然没多大需求，但闲着就得折腾一下，感觉可以凑合用，从方形变成圆形，从字体到自己制作，基本没有啥好讲的，毕竟懒，毕竟文笔不行。 其实若是按照网上那一套来个草稿图什么的装下X，感觉似乎的确能提升点儿逼格。嘿嘿{:扶眼镜:}","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"},{"name":"日常","slug":"日常","permalink":"https://www.iloveyz.com/tags/日常/"},{"name":"like页面","slug":"like页面","permalink":"https://www.iloveyz.com/tags/like页面/"},{"name":"研究","slug":"研究","permalink":"https://www.iloveyz.com/tags/研究/"},{"name":"工作","slug":"工作","permalink":"https://www.iloveyz.com/tags/工作/"},{"name":"hexo","slug":"hexo","permalink":"https://www.iloveyz.com/tags/hexo/"}]},{"title":"准备换个博客环境，和老弟一起记录日常...","slug":"blog-study","date":"2017-08-18T13:58:50.000Z","updated":"2017-12-26T08:26:05.199Z","comments":true,"path":"6997/","link":"","permalink":"https://www.iloveyz.com/6997/","excerpt":"申请hexo其实没几天，日夜折腾，虽然没折腾出什么来，但也图一开心，挺有成就感，也特别的有意思。建站之初就是想自己在网络上得有个自己的地方，用来记录和分享。不仅可以看到自己的成长，也可以分享喜悦。","text":"申请hexo其实没几天，日夜折腾，虽然没折腾出什么来，但也图一开心，挺有成就感，也特别的有意思。建站之初就是想自己在网络上得有个自己的地方，用来记录和分享。不仅可以看到自己的成长，也可以分享喜悦。 自从上学时，就喜欢上网折腾，以前是PS，还清晰记得在点点论坛的成长（现在这个论坛已经找不到啦），那个时候在网络上也结交了许多志同道合的朋友。自从接触论坛后，便一发不可收拾，每天想着自己的原创帖。因为那个时候着实技术太差，为了自己的原创帖，更是努力学习，加强技艺。就这样我的学习之路开始了。不久我的第一个原创帖也出炉了，看着自己的帖子，倍儿自豪。虽然算不上什么多高深的技术，但必须是自己的帖子。至少迈出了那一步。{:doge:} 在论坛混了很久，遇到过不少技术大牛，也学了不少东西，之后意外发现点点论坛是个论坛程序，于是寻着链接而去，发现了新大陆discuz论坛。对我这样的萌新来说十分陌生，之前也从未有过接触。立马注册了帐号，开始探索之旅，那个时候的DISUCZ版本还很古老。弄了半天愣是没明白怎么就成为论坛了，带着好奇心四处探寻，随后发现需要虚拟空间或架设本地服务器。对于那个时候的学生党我而言，无疑是没有闲钱买空间的。不过，既然弄懂了如何操作，就一步步的架设起了本地服务器（那时并没有如今的一键集成），什么PHP，MYSQL这些照着给的教程配置，安装，最后也成了。之后就是一个人的论坛…{:酷:} 玩腻后，决定开始寻求免费空间，搭建个有网络的论坛。找了好些天，国内外测试无数，那个时候很流行发帖免费用空间，于是我混成了某免费空间的超级版主，他们倒也信任我，让我担任审核员专门给别人开通发放免费空间的人…倒也不错，干了一阵子，自己也搭起了自己的第一个论坛，用了很长时间。发放免费空间论坛最终被我干倒闭了…厉害了！~不过和我没半毛钱关系，后来也是服务器压力太大，不得不转收费，结果人全跑了…{:鼓掌:} 我也待了一段时间撤了，从DZ转战PW（phpwind）。在PW也玩的风升水起，热心肠的帮助别人，广受好评（有吹嘘成份，勿轻信）。{:挤眼:} 在PW之后深感学习不足，开始了学习之路，HTML+CSS那个时候还流行TABLE，我还模仿做过很古老的多玩首页。在初学阶段急于求成，结果遇到一border给我难住了，以为是图片却是一个样式…现在想想可笑至极，哈哈…{:可爱:} 后来完成自己的目标“学业”，开始了建站之旅，建了一个用新云下载系统的下载站，为此，我还搭建了本地的FTP，当时网速不到现在的10分之一，200KB/S的下载服务器，你受得了嘛！~就这，我的成就感爆棚，从FTP监控里，每时每刻都有不少IP在下载。现在回想起来，如果自己坚持一下，是不是现在都成大站了（好像是这个道理）…还是迫于电费有点扛不住，也心疼我那电脑24小时的不眠不休…最后还有一最主要原因，没太多钱买服务器，那个时候好贵的…掏口袋，数钱中…{:汗:} 这些珍贵回忆，想起来真挺有意思的…对于我初学者来说，不仅学到了很多东西，也更近一步了解了网络。对于网站我还是有很深的感情的。{:捂脸:} 说起建立自己的博客，应该从B-BLOG说起，叶轩小屋，是我建立博客的名字，买过yexan.cn域名，便宜的很，仅1元。也买过yexan.com也不贵，备过案的呢！~哈哈，后来都扔了。之后就是小小萤火虫，小小电影院。到现在的赤色娱乐。{:黑线:} 说起来都是黑历史，简单而快乐。{:嘻嘻:} 而现在，没有那份干劲啦！~一是随着年龄的增加，二是精力有限，三是有点小忙。所以想着找一僻静地方，有个自己的一片天地，和我老弟记录学习和成长就挺好…而剩下的呢，那就是乐此不疲的折腾… 于是，最近发现了hexo，又偶然找到了bitcron，可惜后者内测阶段，去申请并没有注册邀请，苦恼。前者呢，更新又特别麻烦，还必须是电脑，再输几条命令上传…hexo全都好，唯独这一点，让我很烦躁，也是我吐槽最多的地方，所以如果bitcron可以发我注册邀请，就决定把站搬去bitcron…哈哈！~ 不过也只是这样想的，并没有实际作用，谁知道这一申请需要多久，又什么时候可以批准呢…不管了，先申请看看吧！~ 卧槽，回头一看，码这么多字了，我数了数快一万多字了（这里有夸张用语，请自行分辨）…","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"}]},{"title":"无题之作二篇章...","slug":"untitled-is-two-topic-blog","date":"2017-08-15T15:53:12.000Z","updated":"2017-08-15T15:53:14.792Z","comments":true,"path":"16363/","link":"","permalink":"https://www.iloveyz.com/16363/","excerpt":"说好不折腾的，结果还是没控制住，简单弄了下关于页，其实也算不上折腾。嘿嘿，以后就慢慢更新文章，把小站充实起来先。","text":"说好不折腾的，结果还是没控制住，简单弄了下关于页，其实也算不上折腾。嘿嘿，以后就慢慢更新文章，把小站充实起来先。 网站还没想好以什么为主题，是娱乐，还是日常，完全没有头绪，就像码代码一样，键盘敲的夸啦夸啦（相声词），结果到最后又没啥头绪。谜… - 今天准备给小站关联个微博号，结果结满蜘蛛网的微博上不知道为何多了N多我不曾发过的东西。结果一顿删，把我弹琴且娇嫩的手都累酸了，罢。 看到许久前建站时去友站评论时留下的身影，看着评论一条条，感慨，试着打开链接，多数是打不开了，少数还可以看到仍在坚持。满满的都是回忆啊。 很少这么娇情。今天娇性大发，没忍住，不管啦，这篇流水文就得这么写。 - 今天搞工作忙活一天，算是把最棘手的问题解决了，定位-距离-附近，目前已经把前两个搞定了。剩下的就是附近这一功能。不得不吐槽百度的定位，不仅误差很大，而且不同浏览器误差也存在，还得写兼容，头都大了。得亏还有两把刷子，透露一下，其实主要是长相威摄住了全场（笑）。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"},{"name":"杂谈","slug":"杂谈","permalink":"https://www.iloveyz.com/tags/杂谈/"}]},{"title":"hexo部分暂时折腾结束，回归工作...","slug":"hexo-edit-finished-back-to-work","date":"2017-08-15T00:52:48.000Z","updated":"2017-12-08T14:40:59.927Z","comments":true,"path":"29240/","link":"","permalink":"https://www.iloveyz.com/29240/","excerpt":"","text":"折腾结束喽，该收拾收拾把工作解决解决了，回头会记录一下，嘿嘿。折腾的还不错，虽然没有实现啥特别的功能，但也还算满意，所以就暂且这样吧。反正以后想起来还会继续折腾些适用于我的小东西。这样也算在网络上有个地方。 再次吐槽，hexo不能手机随时随地更新略不爽。 最近把视频页响应式完成了，又用了大多时间把手机上播放视频的功能整理了下，算是大功告成了。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"},{"name":"hexo","slug":"hexo","permalink":"https://www.iloveyz.com/tags/hexo/"}]},{"title":"关于hexo，顺便感慨一下，基本标题要长一点好像才比较不错...","slug":"untitled-is-big-boss-yeah-baby","date":"2017-08-11T07:51:37.015Z","updated":"2017-08-14T15:53:12.251Z","comments":true,"path":"53250/","link":"","permalink":"https://www.iloveyz.com/53250/","excerpt":"好像开通hexo到现在还没正儿八经的写过啥，其实不是文笔不行，而是真的不行，码字容易记流水帐。小学作文就没入过老师法眼，更别提初中高中大学了，那简直是人见人流泪，不是感动的，而是辣眼睛。嘿嘿！~","text":"好像开通hexo到现在还没正儿八经的写过啥，其实不是文笔不行，而是真的不行，码字容易记流水帐。小学作文就没入过老师法眼，更别提初中高中大学了，那简直是人见人流泪，不是感动的，而是辣眼睛。嘿嘿！~ 关于hexo这两天研究主题的修改以及添加个视频页，#朕的视频页&lt;–既然这么闲，那就跑去瞅瞅吧。 还有就是主题的简单修改，之前也写过，是啊，也是闲瑕之余，反正有空就再说一次。 关于视频页视频页有个样儿了至少，可以分出个普通青年，2B青年，喔不，普通页面和视频页面，但首页没辙只能和普通文章一样，没区分。还在想呢，暂时就这样吧！ 关于本站本站主要以娱乐记录为主，虽然这么说，但依着hexo更新这么费劲，估计年更。玩儿呢，抽空更新吧。因为赤色实验室是在并非正式站使用，如果是正式会叫赤色娱乐，所以没必要日…更，别找了暂时没更这个人。。。 好，差不多叨叨完了，暂时不知道该说啥了，我还是个害羞的boy…","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://www.iloveyz.com/tags/hexo/"},{"name":"无题","slug":"无题","permalink":"https://www.iloveyz.com/tags/无题/"}]},{"title":"视频页展示，主要用来展示，暂时没想到其它好的作用，观赏下社会青年魅力也不错！~","slug":"video-article-desigen","date":"2017-08-11T00:54:48.734Z","updated":"2017-12-08T14:37:42.791Z","comments":true,"path":"61722/","link":"","permalink":"https://www.iloveyz.com/61722/","excerpt":"","text":"这篇主要是用来提供观赏使用，视频页…还有一重要的事情","categories":[{"name":"视频","slug":"视频","permalink":"https://www.iloveyz.com/categories/视频/"}],"tags":[{"name":"设计","slug":"设计","permalink":"https://www.iloveyz.com/tags/设计/"},{"name":"视频","slug":"视频","permalink":"https://www.iloveyz.com/tags/视频/"}]},{"title":"赤色实验室主题简单修改","slug":"about-theme-edit","date":"2017-08-08T07:39:42.000Z","updated":"2017-12-26T08:25:36.810Z","comments":true,"path":"24735/","link":"","permalink":"https://www.iloveyz.com/24735/","excerpt":"使用了hexo里 yanm1ng 的 vexo 对主题进行了稍微修改，还未完善，主要还是添加（扒）了一些功能在这个主题里，不管如何还是挺满意的，有了自己想要的功能和样式。","text":"使用了hexo里 yanm1ng 的 vexo 对主题进行了稍微修改，还未完善，主要还是添加（扒）了一些功能在这个主题里，不管如何还是挺满意的，有了自己想要的功能和样式。因为对hexo很陌生，有些地方着实让我挺烦恼的。样式就很难写啊，不知道是不是编辑器的问题，有时候如果不按规定tab或空格就会使样式显示不出来，甚至还会把原先的样式给取消掉。不过现在倒是弄明白怎么回事了。 不管怎样，大致都添加完，就剩样式了。 有一点不爽的是只能在电脑端更新文章，手机端好像没有这个功能？ 不过倒不是特别影响，嘿嘿。","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"折腾","slug":"折腾","permalink":"https://www.iloveyz.com/tags/折腾/"},{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"},{"name":"赤色实验室","slug":"赤色实验室","permalink":"https://www.iloveyz.com/tags/赤色实验室/"},{"name":"主题","slug":"主题","permalink":"https://www.iloveyz.com/tags/主题/"},{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/tags/笔记/"}]},{"title":"赤色实验室开篇第一章","slug":"first-artcile","date":"2017-08-08T07:39:00.000Z","updated":"2017-12-26T13:40:11.245Z","comments":true,"path":"26462/","link":"","permalink":"https://www.iloveyz.com/26462/","excerpt":"初次使用git在github上搭建hexo，感觉还是蛮不错的，在编辑器里写文章还是头一次。不得不说新鲜+成就感油然而生，虽然搭建没有什么难度。","text":"初次使用git在github上搭建hexo，感觉还是蛮不错的，在编辑器里写文章还是头一次。不得不说新鲜+成就感油然而生，虽然搭建没有什么难度。我还是比较喜欢折腾的，以前使用wordpress做过几个站，感觉很有意思，这次零投入用下github","categories":[{"name":"笔记","slug":"笔记","permalink":"https://www.iloveyz.com/categories/笔记/"}],"tags":[{"name":"博客","slug":"博客","permalink":"https://www.iloveyz.com/tags/博客/"},{"name":"赤色实验室","slug":"赤色实验室","permalink":"https://www.iloveyz.com/tags/赤色实验室/"}]},{"title":"Hello World","slug":"hello-world","date":"2017-08-07T06:47:11.049Z","updated":"2017-08-14T15:53:12.249Z","comments":true,"path":"16107/","link":"","permalink":"https://www.iloveyz.com/16107/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}